{
    "quotes": [
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "This is the best evidence for the recommendation to bath on the two ʿĪd celebrations, narrated by al-Bayhaqī:\nA man once asked ʿAlī – Allah be pleased with him – about taking a full bath (ġusl).\nHe replied, “Wash every day if you want.”\nThe man said, “No, what I mean is al-ġusl.”\nʿAli replied, “al-Jumuʿah (Friday), the Day of ʿArafah, the Day of al-Naḥr (sacrificial slaughter, ʿĪd al-Adhā) and the Day of al-Fiṭr (the ʿĪd following Ramaḍān).”\nThe chain of narration is authentic.",
            "hijri_dates": [29],
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 176,
            "title": "Irwāʾ al-Ġalīl fī Takhrīj Aḥādīth Manār al-Sabīl",
            "url": "https://t.me/ilmtest/388"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "From Abū Hurayrah (may Allah be pleased with him) who said: “There were two men from Baliyy, from the (tribe of) Qudā‘ah who accepted Islām and joined Allah‘s Messenger ﷺ.\nThen one of them was martyred and the other one died a year later.\nSo Ṭalhah b. ʿUbaydillāh (may Allah be pleased with him) said: I saw the one delayed (in a dream) and he was entered into Paradise before the martyr, so I was surprised at that. So I mentioned that to Allah’s Messenger ﷺ.\nSo Allah’s Messenger ﷺ said: “Did he not fast Ramaḍān after him, and pray six-thousand (more) rakʿahs, and such and such Sunnah prayers?”\nReported by Aḥmad with a Ḥasan chain of narration.\n[Ḥasan Ṣaḥīḥ]",
            "hijri_dates": [1],
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 273,
            "title": "Ṣaḥīḥ al-Tarġīb wa ʿl-Tarhīb",
            "url": "https://t.me/ilmtest/928"
        },
        {
            "author": "Ṣāliḥ al-Fawzān",
            "body": "O Muslims! A great month is at hand, and a noble guest will visit you soon: {The month of Ramaḍān in which was revealed the Qurʿān, a guidance for mankind and clear proofs for the guidance and the criterion (between right and wrong)} [Al-Baqarah 2:185]\nAllāh has ordained it‘s fast as one of the pillars of Islām, and standing during it’s night (for prayer) from the tremendous voluntary acts.",
            "hijri_months": [9],
            "title": "salihalfawzan",
            "url": "https://t.me/ilmtest/1214"
        },
        {
            "after": {
                "events": ["isha"]
            },
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "Question: Noble Shaykh, whoever prays the Tarāwīḥ (prayer) must he then continue to pray them all throughout Ramaḍān?\nAnswer: No he does not have to continue (to pray them) because it is a recommended (Sunnah) prayer in that if he prays them then he is rewarded and if he leaves them then he is not a sinner. However, (in leaving them) he misses out on a lot of good as we have said (before).",
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 254,
            "title": "Fiqh al-ʿIbādāt",
            "url": "https://t.me/ilmtest/1234"
        },
        {
            "author": "al-Shawkānī",
            "body": "Fasting the month of Ramaḍān is obligatory upon the sighting of the crescent by a trustworthy individual, or (in the case of the crescent not being sighted) by the month of Shaʿbān being completed. It is obligatory to fast for thirty days so long as the crescent of Shawwāl is not sighted before thirty days of Ramaḍān being completed. If the people of a particular land see and confirm the sighting of the crescent, it is upon the other countries to conform to this sighting. It is upon the fasting person to make the intention to fast before Fajr.",
            "hijri_dates": [28, 29],
            "hijri_months": [8],
            "part_number": 5,
            "part_page": 2490,
            "title": "al-Fatḥ al-Rabbānī",
            "url": "https://t.me/ilmtest/1707"
        },
        {
            "author": "Ibn al-Qūdāmah al-Maqdisī",
            "body": "Laylah al-Qadr is sought during the last ten nights of Ramaḍān,\nwith the odd nights being more likely,\nand the night of the twenty-seventh holding the greatest hope.\nOne should make the supplication narrated from ʿĀ'ishah, may Allah be pleased with her, who said, “O Messenger of Allah, if I find Laylah al-Qadr, what should I supplicate?”\nHe said: Say: “O Allah, You are Forgiving and love forgiveness, so forgive me.”",
            "hijri_dates": [21, 23, 25, 27, 29],
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 106,
            "title": "al-Muqniʿ fī Fiqh ʿl-Imām Aḥmad",
            "url": "https://ilmtest.tumblr.com/post/747228500658962432"
        },
        {
            "author": "al-Nasāʾī",
            "body": "Ibn ʿUmar (may Allah be pleased with him) who said: The Messenger of Allah ﷺ enjoined zakāt al-fīṭr upon the people at the end of Ramaḍān, a ṣāʿ of dates or a ṣāʿ of barley, upon everyone, free or slave, male or female, among the Muslims.",
            "hijri_dates": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
            "hijri_months": [9],
            "part_number": 3,
            "part_page": 37,
            "title": "al-Sunan al-Kubrá",
            "url": "https://t.me/ilmtest/3877"
        },
        {
            "author": "Ibn Taymiyyah",
            "body": "Ibn ʿAbbās (may Allah be pleased with him) reported that the Messenger ﷺ said:\nJibrīl led me in Salāh twice at the House.\nSo he prayed al-Dhuhr the first day when the shadow was similar to the length of the strap of a sandal (just after midday).\nThen he prayed al-ʿAṣr when an object was similar to the length of its shadow.\nThen he prayed al-Maġrib when the sun had set and the fasting person breaks the fast.\nThen he prayed al-ʿIshāʾ when the twilight had vanished.\nThen he prayed al-Fajr when the true dawn began (before sunrise), and when eating is prohibited for the fasting person.\nThe second occasion he prayed al-Dhuhr when the shadow of everything was similar to the length of it, which was the time of al-ʿAṣr the day before.\nHe prayed al-ʿAṣr when the shadow of an object was about twice as long as it.\nThen he prayed al-Maġrib at the same time as he did the first time.\nThen he prayed al-ʿIshāʾ, the later one, when a third of the night had gone.\nThen he prayed al-Fajr when the land glowed (before sunrise).\nThen Jibrīl turned towards me and said: “O Muḥammad! These are the times of the Prophets before you,\nand the time is what is between these two times (for each prayer).”",
            "part_number": 1,
            "part_page": 150,
            "title": "Sharḥ al-ʿUmdah Kitāb al-Ṣalāh",
            "url": "https://t.me/ilmtest/4746"
        },
        {
            "after": {
                "events": ["maghrib", "fajr", "isha"]
            },
            "author": "Ibn al-Qayyim",
            "body": "This is why the Prophet ﷺ used to recite the two Sūrahs (al-Kāfīrūn and al-Ikhlāṣ) in the Sunnāh prayer of al-Fājr, wa ʿl-Maġrib wa ʿl-Wītr prayer, which commence and conclude one's actions [of the day and night], so that the day would begin with Tawḥīd and end with Tawḥīd.",
            "part_number": 2,
            "part_page": 94,
            "title": "Ijtimāʿ al-Juyūsh",
            "url": "https://t.me/ilmtest/4244"
        },
        {
            "after": {
                "events": ["maghrib", "asr"]
            },
            "author": "Ibn Taymiyyah",
            "body": "He (may Allah have mercy on him) was asked: “If a person missed the ʿAṣr (afternoon prayer), and when he arrived to the masjid he found maġrib (sunset prayer) has started, which prayer should he pray first?”\nAnswer (may Allah have mercy on him): All Praise is due to Allah, the Lord of all that exists. He should pray maġrib with the Imām (the one leading the prayer at the masjid), then pray al-ʿAṣr afterwards, as agreed upon by all leading scholars.\nHowever, should he repeat the maġrib prayer (after having prayed it with the Imām)?\nThis has two scholarly opinions.\nThe first is that he repeats. This is the saying of Ibn ʿUmar, Mālik, Abū Ḥanīfah and Aḥmad in what is most well-known about this issue.\nThe second opinion is that he does not repeat. This is the saying of Ibn ʿAbbās, the Shāfiʿī maḏhab, and the second opinion of the maḏhab of Imām Aḥmad.\nThe second opinion is more correct, for Allah did not make it obligatory on the person to pray a ṣalāh twice if he has feared Allah as much as he can.\nAnd Allah knows best.",
            "part_number": 22,
            "part_page": 106,
            "title": "Majmūʿ al-Fatāwá",
            "url": "https://t.me/ilmtest/1304"
        },
        {
            "after": {
                "events": ["asr", "fajr"]
            },
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "Exaltations/Supplications of the Morning and Evening\nQuestioner: “When is the time for making the morning and evening adhkār (exaltations/ supplications)?”\nal-Shaykh: “The morning adhkār are said after Fajr and the evening adhkār are said after ʿAṣr.”\nQuestioner: “Okay, what is the proof for this O Shaykh? We heard in Afġānistān that you said the evening adhkār are said after Maġrib?”\nal-Shaykh: “No, it is after ʿAṣr.”\nQuestioner: “Okay, what is the dalīl (proof) for this?”\nal-Shaykh: “Because al-masāʾ (ie: evening) linguistically starts after ʿAṣr.”",
            "part_number": 192,
            "part_page": 6,
            "title": "Silsilah al-Hudá wa ʾl-Nūr",
            "url": "https://t.me/ilmtest/696"
        },
        {
            "author": "Isḥāq al-Kawsaj",
            "before": {
                "diff": "1h",
                "events": ["maghrib"]
            },
            "body": "I asked (Imām Aḥmad): “When is the hour that is hoped for on Friday?”\nHe replied: Most of the ḥadīths indicate that it is after al-ʿAṣr.\nIsḥāq said: “After al-ʿAṣr — I hardly have any doubt about it, and I also hope for the time after the sun has passed its zenith.”",
            "days": [5],
            "part_number": 2,
            "part_page": 874,
            "title": "Masāʾil al-Imām Aḥmad wa Isḥāq Ibn Rahāwiyah",
            "url": "https://t.me/ilmtest/5400"
        },
        {
            "after": {
                "events": ["dhuhr", "asr"]
            },
            "author": "Aḥmad Shākir",
            "body": "And (Imām) Aḥmad said: Most of the aḥādīth about al-sāʿah (ie: the hour) in which it is hoped for al-duʿāʾ (ie: supplications) to be answered: it is after ṣalāt al-ʿAṣr, and it is hoped (too) after the sun has passed its zawāl (ie: zenith).",
            "part_number": 7,
            "part_page": 406,
            "title": "Musnad Aḥmad",
            "url": "https://t.me/ilmtest/4884"
        },
        {
            "author": "ʿAbd al-Muḥsin al-ʿAbbād",
            "before": {
                "diff": "1h",
                "events": ["maghrib"]
            },
            "body": "Jābir b. ʿAbd Allah (may Allah be pleased with him) that the Prophet ﷺ said:\n“Friday is divided into twelve hours.\nAmongst them there is an hour,\nIn which a Muslim does not ask Allah the Mighty and Majestic for anything but He the Mighty and Majestic gives it to him.\nSo seek it in the last hour after al-ʿAṣr (ie: the afternoon prayer).”",
            "part_number": 133,
            "part_page": 8,
            "title": "Sharḥ Abī Dāwūd",
            "url": "https://t.me/ilmtest/3320"
        },
        {
            "after": {
                "events": ["asr"]
            },
            "author": "Ibn ʿAbd al-Barr",
            "body": "Whenever Saʿīd (b. Jubayr) prayed al-ʿAṣr prayer, he would not conversate with anyone up until the sun had set (ie: he was busy with supplication).",
            "part_number": 19,
            "part_page": 24,
            "title": "al-Tamhīd limā fī ʾl-Muwaṭṭaʾ min al-Maʿānī wa ʾl-Asānīd",
            "url": "https://t.me/ilmtest/4190"
        },
        {
            "author": "ʿAbd al-Razzāq al-Ṣanʿānī",
            "body": "From Ibn Jurayj that ʿAṭāʾ said: “If the day of al-Jumuʿah (ie: Friday) and ʿĪd al-Fīṭr fall on the same day, then a person should combine both prayers (ie: the Jumuah and ʿĪd prayer) and offer two rakʿats only, when he offers the prayer of ʿĪd.\nAnd then he will remain like that until the time of Asr begins”.\n(Ibn Jurayj) then said: Then he narrated to me: On an occasion the day of al-Jumuʿah and ʿĪd fell on the same day at the time of Ibn ʿl-Zubayr.\nIbn al-Zubayr said: “Two ʿĪds have fallen on the same day.”\nThen he combined both of them and declared it as one,\nAnd he offered two rakʿats on the day of al-Jumuʿah of ʿĪd and then he did not offer any prayer until the prayer of al-ʿAṣr“.\n(ʿAṭāʾ) said: “As far as al-fuqahāʾ (ie: the jurists) are concerned then they do not tend to agree with this and as far as a person who does not contemplate the fiqh of this matter, then he denies it”.\n(ʿAṭāʾ) said, “I also denied this fatwá and offered al-Dhuhr on that day.”\n(He continued): Until later on, the tradition had reached to me that: “If two ʿĪds fall on the same day then it will be offered only one time (out of two prayers).”\n(Ibn Jurayj) said: And it has also been narrated from Muḥammad b. ʿAlī b. al-Ḥusayn: “If two ʿĪds fall on the same day then they will be combined as one prayer.”",
            "days": [5],
            "hijri_dates": [1],
            "hijri_months": [10],
            "part_number": 3,
            "part_page": 303,
            "title": "al-Muṣannaf",
            "url": "https://t.me/ilmtest/3000"
        },
        {
            "after": {
                "events": ["fajr", "asr"]
            },
            "author": "ʿAbd al-ʿAdhīm al-Munḏirī",
            "body": "Abū Zuhayrah ʿUmārah b. Ruwaybah (may Allah be pleased with him) reported that the Messenger ﷺ said: “One who offers prayer before the rising of the sun, and the setting of the sun will not enter the Fire.” This is referring to al-Fajr and al-ʿAṣr.\nReported by Muslim.",
            "part_number": 1,
            "part_page": 175,
            "title": "al-Tarġīb wa ʾl-Tarhīb",
            "url": "https://t.me/ilmtest/2266"
        },
        {
            "after": {
                "events": ["fajr", "asr"]
            },
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "Preserving the Fajr and ʿAṣr prayers is from the reasons for looking at the Face of Allah. Preserve the Fajr and ʿAṣr prayer, and you will look at the Face of Allah on the Day of Resurrection in the Gardens of Delight.",
            "part_number": 5,
            "part_page": 58,
            "title": "Sharḥ Riyaḍ al-Ṣāliḥīn",
            "url": "https://t.me/ilmtest/1606"
        },
        {
            "after": {
                "events": ["dhuhr"]
            },
            "author": "ʿAbd al-Muḥsin al-ʿAbbād",
            "body": "Explanation of the ḥadīth: “Four before al-Dhuhr (noon prayer); there is no taslīm (concluding salutation) among them; for them the gates of heaven are opened.”\nThe compiler, may Allah have mercy on him, said: [ḥaddathanā Ibn al-Muthanná; ḥaddathanā Muḥammad b. Jaʿfar; ḥaddathanā Shuʿbah; he said: I heard ʿUbaydah narrating from Ibrāhīm, from Ibn Minjāb, from Qurthaʿ, from Abū Ayyūb (may Allah be pleased with him) from the Prophet ﷺ who said: “Four before Dhuhr; there is no taslīm among them; for them the gates of heaven are opened.”\nAbū Dāwūd said: It reached me from Yaḥyá b. Saʿīd al-Qaṭṭān that he said: If I were to narrate anything from ʿUbaydah, I would narrate this ḥadīth from him.\nAbū Dāwūd said: ʿUbaydah is ḍaʿīf (weak).\nAbū Dāwūd said: Ibn Minjāb is Sahm.\nAbū Dāwūd — may Allah have mercy on him — brought the ḥadīth (prophetic report) of Abū Ayyūb (may Allah be pleased with him) that the Prophet ﷺ said: “Four before Dhuhr; there is no taslīm among them; for them the gates of heaven are opened).”\nThis indicates the ṣalāh (prayer) of four before Dhuhr, and that there is no taslīm among them — its meaning is that they are connected, with no taslīm in the middle but rather at the end. However, the aḥādīth have come stating that the ṣalāh is two by two, and the ḥadīth contains this man about whom there is criticism.\nal-Albānī graded this ḥadīth ḥasan (good), and I do not know what the basis of declaring it good is, for the man in the isnād (chain of transmission) is weak and underwent ikhtiṭlāṭ (confusion), and he is ʿUbaydah b. Muʿattib.\nSo if there are shawāhid (supporting narrations) or something relied upon other than this route, then there would be a case for it. And even if the ḥadīth were ṣaḥīḥ (authentic), what is preferable is that the rawātib (regular supererogatory prayers) and the nawāfil (supererogatory prayers) be performed two by two, and it is permissible to perform them as a continuous sequence if the ḥadīth from the Messenger of Allah ﷺ is authentic.\nShaykh Nāṣir — may Allah have mercy on him — authenticated the ḥadīth with the wording: “Four rakʿahs (units of prayer) after zawāl (when the sun passes the meridian) before Dhuhr; there is no taslīm between them; they are equivalent to the ṣalāt al-saḥar (pre-dawn prayer).”\nIt is in al-Silsilah al-Ṣaḥīḥah, volume three.\nIf the ḥadīth is authentic, then it is permissible to string them together, though not stringing them together is preferable.\nJust as the night ṣalāh is “two by two,” it is permissible to combine as four on its own, and four on its own, and three on its own, as that has come from the Messenger of Allah—may Allah bless him and grant him peace—so connecting and separating are both permissible, but separating is preferable to connecting.\nAnd if we say connecting them is allowed, then does one perform a middle tashahhud?\nThe answer that appears is that he does not perform it, so that it does not become as though it were Dhuhr; for if a person were to do that, it would be as though he had prayed Dhuhr.",
            "part_number": 156,
            "part_page": 22,
            "title": "Sharḥ Abī Dāwūd",
            "url": "https://t.me/ilmtest/5608"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "before": {
                "events": ["dhuhr"]
            },
            "body": "ʿUmar b. al-Khaṭṭāb (may Allah be pleased with him) reported that the Messenger (ﷺ) said: “Whoever sleeps without doing his regular ḏikr or part of it, then recites it during the time between the Fajr prayer and Dhuhr prayer, it will be recorded as if he had recited it at night.”\nReported by Muslim, Abū Dāwūd, al-Tirmiḏī, al-Nasāʾī, Ibn Mājah, and Ibn Khuzaymah in his Ṣaḥīḥ.\nṢaḥīḥ",
            "part_number": 1,
            "part_page": 419,
            "title": "Ṣaḥīḥ al-Tarġīb wa ʿl-Tarhīb",
            "url": "https://t.me/ilmtest/4153"
        },
        {
            "after": {
                "events": ["dhuhr"]
            },
            "author": "al-Nasāʾī",
            "body": "Umm Ḥabībah (may Allah be pleased with her) that the Prophet (ﷺ) said: “Whoever prays four (rakʿahs) before al-Dhuhr and four after it, the Fire will not touch him.”",
            "part_number": 2,
            "part_page": 188,
            "title": "al-Sunan al-Kubrá",
            "url": "https://t.me/ilmtest/4116"
        },
        {
            "after": {
                "events": ["fajr"]
            },
            "author": "Rabīʿ b. Hādī al-Madkhalī",
            "body": "Question: “What is the correct position for working according to the calendar times for the prayers and that which is printed and circulated among many of the people especially in the West? Is it simply according to the entrance of the time specified on the calendar or is it better to wait a little to be on the safe side? We would like from you noble Shaykh some instruction for those in charge on the Masjids. And if differing occurs amongst the people concerning this matter what do you advise them with?”\nAnswer: This requires precise experimenting and testing of these calendars by way of study from the Muslims ‘on the ground’ as they say.\nThey look at the time of Fajr on the calendar to see what hour and minute the calendar says, then they go outside of the city to a place that has no lights and they look for the light of Fajr in real time; as it has been described by the Messenger peace be upon him. If they see that it agrees with the calendar, they affirm it. If it differs then say to the Muslims, this differs from the actual time therefore wait this amount of time.\nThis problem is found in the Muslim countries now; in Morocco and other places; in Algeria and other places unfortunately. The Muslims have become careless with regards to their prayer. Some people have complained that they set the time for Fajr about fifteen minutes before it enters. And Allah knows best.\nWe said to the Salafis; ‘experiment’. Go outside of the cities and look at the time of Fajr in a place that is far from lights. Fajr will become clear to you upon its reality. If it agrees (with the calendar) all praises belong to Allah. We will be relieved from the suspicions, problems and delusions, and confusion of the people. If it does not agree (with the calendar) then we present this to the responsible authority at the ministry. We say to them, we have experimented, and we would like to go out with you all for a second experiment. We found this time while the calendar contradicts the real time. This is my view on issue.",
            "part_number": 2,
            "title": "rabee.net",
            "url": "https://t.me/ilmtest/1881"
        },
        {
            "after": {
                "events": ["fajr", "sunrise"]
            },
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "A question for the esteemed Shaykh!\n“I miss the Fajr prayer often,\nand I do not pray (it) except after sunrise at the time I want to go to work.\nAnd this matter might happen again and again, so is there any (sin) upon me?\nAnd What should I do in order to stick to my prayer on time?”\nAnswer: Do a number of things.\nFirstly: That you sleep early.\nAnd it is for this reason the Prophet ﷺ used to hate (one's) sleeping before al-ʿIshāʾ and enganging in discussions after it.\nSo that a person may go to sleep early in order to wake up early.\nSecondly: that you have an intention at the time of going to sleep. a resolve, and determination that you are going to wake up for Ṣalāt al-Fajr.\nThen waking up will be easy for you.\nThirdly: is that you use an alarm clock you put by your head that sets off an alarm for you.\nAnd if you are afraid that when it goes off, you will switch it off, turn off the sound, and keep sleeping, keep it away from you a bit.\nAnd someone, out of concern for the prayer, would put the alarm clock in a tin can,\nAnd keep it at a distance from himself, so that it would have a powerful sound, so he would wake up.\nDo this.\nThere is nothing prohibiting (it).\nIf this were not easy for you, put a telephone by your head, if you have a telephone,\nAnd tell one of your brothers: “When the Aḏān for al-Fajr is given, call me.”\nWhat is important is that a person can do things which result in his waking up so that he can perform al-Fajr in its time.\nAnd one who makes laziness a habit for himself will remain upon laziness.\nAs for prayer in other than its time, if one intended [that], then the prayer is not accepted.\nIt is rejected from him,\neven if he were to pray it a thousand times,\ndue to the saying of the Prophet: “Whoever does an act that is not under our legislation, it will be rejected.”\nmeaning it is returned back to him (ie: not accepted).",
            "part_number": 32,
            "part_page": 23,
            "title": "al-Liqāʾ al-Shahrī",
            "url": "https://t.me/ilmtest_research/277"
        },
        {
            "after": {
                "events": ["lastThirdOfTheNight"]
            },
            "author": "Aḥmad b. Ḥanbal",
            "body": "Abū Hurayrah (may Allah be pleased with him) reported that Allah's Messenger ﷺ said, “Our Lord, the Mighty and Majestic, comes every night down on the nearest Heaven to us when the last third of the night remains, saying: ”Is there anyone to invoke Me, so that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is there anyone seeking My forgiveness, so that I may forgive him?\"",
            "part_number": 16,
            "part_page": 211,
            "title": "al-Musnad",
            "url": "https://t.me/ilmtest/2111"
        },
        {
            "after": {
                "events": ["lastThirdOfTheNight"]
            },
            "author": "Ibn Rajab",
            "body": "And some people who were known for this (to rely on the stars for knowledge of what may or may not happen) objected to the ḥadīth where the Prophet ﷺ said that Allah descends in the third of the night, so they said: “The third of the night differs depending on the country, and it is not possible that Allahs descension be at any specific time.” However, that which is obligatory to have knowledge of in Islām, is that this type of objection is completely disgusting.\nAnd that if the Prophet Muḥammad ﷺ and His rightly guided Caliphates were to hear this from this person, they would not even look at him,\nRather they would take him to his punishment, and include him in al-mukhālifīn (ie: the group of those who go against the truth), al-munāfiqīn (ie: the hypocrites), and al-mukhaḏibīn (ie: the liars).",
            "part_number": 1,
            "part_page": 2,
            "title": "Bayān Faḍl ʿIlm al-Salaf ʿalá ʿIlm al-Khalaf",
            "url": "https://t.me/ilmtest/2110"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "before": {
                "diff": "1h",
                "events": ["middleOfTheNight"]
            },
            "body": "When Does The Time of Ṣalāt al-ʿIshāʾ End?\nQuestioner: “Up until what time is it permissible to delay Ṣalāt al-ʿIshāʾ?”\nThe Shaykh: Up until half of the night (has passed),\nSince that has been clearly stated in Ṣaḥīḥ Muslim,\nFrom the ḥadīth of ʿAbd Allah b. ʿAmr b. al-ʿĀṣ (may Allah be pleased with him), who said: the Messenger of Allah ﷺ said: “And the time for al-ʿIshāʾ is until half the night has passed.”\nAnd (its time) is not until al-Fajr al-Ṣādiq (ie: the time of the true dawn prayer) appears,\nFor there is no dalīl (ie: proof) for that even if some of the Imāms say so,\nBecause that goes against this authentic ḥadīth, \"And the time for al-ʿishāʾ is until half the night has passed.\nYes.",
            "part_number": 97,
            "part_page": 16,
            "title": "Silsilah al-Hudá wa ʾl-Nūr",
            "url": "https://t.me/ilmtest/3310"
        },
        {
            "author": "Ibn Taymiyyah",
            "body": "And in the wording of Abū Hurayrah (may Allah be pleased with him) that the Messenger ﷺ said: The first deed for which a servant will be called to account on the Day of Resurrection is his ṣalāt (ie: prayer).\nIf it is complete, he will be successful and saved,\nbut if it is deficient or corrupted, he will have failed and lost.\nSo if there something is deficient in his obligatory prayers,\nthe Lord (the Mighty and Majestic) will say: “Look, are there any voluntary Prayers for my worshipper?”\nSo with the voluntary prayers what was deficient in his obligatory prayers will be completed.\nThen the rest of his deeds will be treated in the same manner.\nReported by al-Tirmiḏī who said the ḥadīth is Ḥasan.",
            "id": 110885,
            "part_number": 22,
            "part_page": 533,
            "title": "Majmūʿ al-Fatāwá",
            "url": "https://t.me/ilmtest/3967"
        },
        {
            "author": "al-Bayhaqī",
            "body": "Narrated Abū Hurayrah (may Allah be pleased with him): When Allah's Messenger ﷺ made the (opening) takbīr for the prayer, he used to keep silent before his recitation (of the Qurʾān).\nSo we said (to the Prophet ﷺ): “May my parents be sacrificed for you!\nWe saw that you remain silent between al-takbīr wa ʿl-qirāʿah, what do you say (in the pause between takbīr and recitation)?”\n(The Prophet ﷺ) said: I say: “Allahumma bāʿid baynī wa bayna khaṭāyāya kamā bāʿadta bayn al-mashriqi wa ʿl-maġribi (ie: O Allah, separate me from my sins as You have separated the East from the West),\nAllahumma naqqinī min khaṭāyāya kamā yunaqqath-thawb ʿl-abyaḍu min ʿl-danasī (ie: O Allah, cleanse me of my transgressions as the white garment is cleansed of stains),\nAllaahuma aġsilnī min khaṭāyāya, bith-thalji wa ʿl-māʿi wa ʿl-barad (ie: O Allah, wash away my sins with ice and water and frost).”\nReported by Muslim in his Ṣaḥīḥ from Zuhayr b. Ḥarb from Jarīr, and also by way of ʿAbd al-Wāḥid b. Ziyād b. ʿUmārah.",
            "id": 111116,
            "part_number": 4,
            "part_page": 492,
            "title": "Shuʿab al-ʾĪmān",
            "url": "https://t.me/ilmtest/3975"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "The Messenger ﷺ used to order to being tranquil (in the rukūʿ);\nand he said to the person who did not pray properly:\n“Then raise your head until you are standing straight; [until every bone goes back to its place]”,\n(and in a narration: “And when rise from rukūʿ; then straighten your back,\nand raise your head until the bones go back to their joints.”)\nAnd he mentioned to him: “That no one's prayer is complete, if he does not do that.”",
            "id": 111204,
            "part_number": 2,
            "part_page": 700,
            "title": "Aṣl Ṣifah Ṣalāh al-Nabī ṢallAllāhu ʿAlayhi Wa Sallam",
            "url": "https://t.me/ilmtest/3998"
        },
        {
            "author": "al-Bukhārī",
            "body": "al-Bukhārī said: Whoever claims that raising the hands (in prayer) is a bidaʿh (ie: an innovation),\nthen he has defamed the Companions of the Prophet ﷺ,\nand the Salaf and those who came after them,\nand the people of al-Ḥijāz,\nthe people of al-Madīnah,\nthe people of Makkah,\nand a number from the people of al-ʿIrāq\nand the people of al-Shām,\nthe people of Yemen\nand the scholars of Khurasān.",
            "id": 117243,
            "part_number": 1,
            "part_page": 54,
            "title": "Rafʿ al-Yadayn fī ʿl-Ṣalāt",
            "url": "https://t.me/ilmtest/4407"
        },
        {
            "author": "al-Ḏahabī",
            "body": "Ibn al-Madīnī said to Abū ʿl-Walīd: “What excuse will you have before Allah, and by what will you argue when you stand before Him, for leaving the practice of raising the hands before and after bowing in prayer?”\nSo Abū ʿl-Walīd raised his hands after eighty years of not doing so.",
            "id": 119908,
            "part_number": 5,
            "part_page": 718,
            "title": "Tārīkh al-Islām",
            "url": "https://t.me/ilmtest/4754"
        },
        {
            "author": "Maʿmar b. Rāshid",
            "body": "ʿAbd al-Razzāq informed us, on the authority of Maʿmar, on the authority of Qatādah that Kaʿb (may Allah be pleased with him) said: “The first thing a woman will be asked about on the Day of Resurrection will be her ṣalāt (ie: prayer) and the ḥaqqi zawjihā (ie: rights of her husband).”",
            "id": 124938,
            "part_number": 11,
            "part_page": 304,
            "title": "Jāmīʿ",
            "url": "https://t.me/ilmtest/4945"
        },
        {
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "The noble Shaykh was asked: “What is the ruling on placing the right hand on the left hand and placing it on the chest during prayer?\nWhat is the ruling on placing both hands below the navel?\nAnd is there any difference between men and women in this regard?”\nHe answered: Placing the right hand on the left hand in the prayer is Sunnah.\nThe evidence for this is the ḥadīth of Sahl b. Saʿd (may Allah be pleased with him): “The people were ordered to place their right hand on their left forearm in prayer.” Reported by al-Bukhārī.\nBut where the hands should be placed?\nThe answer: in this regard, the most correct opinion is that the hands should be placed on the chest.\nDue to the ḥadīth of Wāʿil b. Ḥajar (may Allah be pleased with him): “The Prophet used to place his right hand on his left hand on his chest.”\nAlthough the chain of narration of the ḥadīth is slightly weak, it is the most correct compared to other opinions.\nPlacing the hands on the heart on the left side is a bidaʿh (ie: innovation) that has no ʿaṣl (ie: basis).\nAs for placing the hands below the navel, there is an athar from ʿAlī to support this, but it is ḍaʿīf (ie: weak).\nThe ḥadīth of Wāʿil b. Ḥajar (of placing them on the chest) is stronger.\nThere is no difference between men and women in this ruling,\nbecause the general principle is that men and women are equal in al-aḥkām (ie: rulings) unless there is dalīl (ie: evidence) to suggest otherwise.\nAnd I do not know of any sound evidence that distinguishes between men and women in this Sunnah.",
            "id": 120890,
            "part_number": 13,
            "part_page": 97,
            "title": "Majmūʿ al-Fatāwá wa Rasāʿil",
            "url": "https://t.me/ilmtest/4926"
        },
        {
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "Q: “Where should a person praying place his two hands in prayer?\nOn his chest?\nOr below his chest?\nOr on his stomach?”\nHe may Allah have mercy on him answered:\nThe correct position is to place his two hands on the chest.\nThis is the best (and most correct opinion), and the evidence for this is the ḥadīth of Wāʿil b. Ḥajar, and this ḥadīth is Ḥasan.",
            "id": 120891,
            "part_number": 8,
            "part_page": 2,
            "title": "Fatāwá Nūrun ʿalá ʾl-Darb",
            "url": "https://t.me/ilmtest/4789"
        },
        {
            "author": "Muḥammad b. Ādam al-Ithīobī",
            "body": "The author (ie: Muḥammad al-Ihtīobī) may Allah forgive him said: In light of al-adillah (Ie: the evidence), al-rājiḥ (ie: the most correct opinion) is that both hands should be placed on the chest during prayer.\nThose who argue for tying the hands below the navel do not have any dalīl ṣaḥīḥ (to support them),\nand those who argue for tying the hands above the navel do not have any evidence either, except that they may interpret placing the hands above the navel as meaning the chest.\nAnd Allah the Exalted knows best what is correct.",
            "id": 120892,
            "part_number": 11,
            "part_page": 281,
            "title": "Ḏakhīrah al-ʿUqbá fī Sharḥ al-Mujtabá",
            "url": "https://t.me/ilmtest/4792"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "(The Messenger ﷺ said): “Remember death in your prayer, for when a man remembers death in his prayer, it is likely that he will improve his prayer.\nPray the prayer of a man who does not think that he will pray any prayer other than it.\nAnd beware of every matter from which one must apologize.”\nReported by al-Daylamī in Musnad al-Firdaws on the authority of Anas who raised it (to the Prophet ﷺ).",
            "id": 121084,
            "part_number": 3,
            "part_page": 408,
            "title": "Silsilah al-Aḥādīth al-Ṣaḥīḥah",
            "url": "https://t.me/ilmtest/4801"
        },
        {
            "author": "Ibn al-Qayyim",
            "body": "You stand in your prayer with your body whilst you have turned your face towards al-qiblah (ie: direction of the Kaʿbah), but you have turned your qalb (ie: heart) towards another place?\nWhat's the matter with you - this prayer is not suitable as mahr (ie: dowry) for al-Jannah (ie: Paradise),\nso how could it be suitable as a price for al-maḥabbah (ie: love of Allah).",
            "id": 122102,
            "part_number": 3,
            "part_page": 233,
            "title": "Badāʾi al-Fawāʾid",
            "url": "https://t.me/ilmtest/4976"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "[Ḥasan] On the authority of Abū Hurayrah (may Allah be pleased with him) that the Prophet ﷺ he said:\n“A man may pray for sixty years, and his prayer will not be accepted.\nPerhaps he may complete al-rukūʿ (ie: the bowing) but not complete al-sujūd (ie: the prostration properly),\nor he may complete al-sujūd but not complete al-rukūʿ (properly).”",
            "id": 124887,
            "part_number": 1,
            "part_page": 347,
            "title": "Ṣaḥīḥ al-Tarġīb wa ʿl-Tarhīb",
            "url": "https://t.me/ilmtest/5121"
        },
        {
            "author": "Ibn al-Jāwzī",
            "body": "Mu'āwiyyah ibn Qurrah reported that Mu`adh bin Jabal advised his son, “My son! Pray the prayer of he who is just about to leave and imagine that you might not be able to pray ever again. Know that the believer dies between two good deeds, one that he performed and one that he intended to perform later on.”",
            "part_number": 1,
            "part_page": 188,
            "title": "Sifat as-Safwa",
            "url": "https://t.me/ilmtest/53"
        },
        {
            "author": "Abu Hafs al-Bazzār",
            "before": {
                "events": ["fajr"]
            },
            "body": "During the nights, he (Ibn Taymiyyah) would separate himself from everybody, secluding himself with his Lord, strictly maintaining his recitation of the Qur'ān, and repeating the various types of daily and nightly worship.\n\nWhen the night was over, he would rejoin the people for the Fajr prayer, praying the optional prayer before meeting them.\n\nWhen he would begin the prayer, your heart would want to fly from its place just from the way in which he would make Takbirat al-Ihram.\n\nWhen he would begin the prayer, his limbs would shake, moving him left and right.\n\nWhen he would recite, he would elongate his recitation, just as was authentically reported in regards to the recitation of the Messenger of Allāh ﷺ.\n\nHis bowing and prostration, as well as his coming up from them, are from the most complete of what has ever been reported in regards to the obligatory prayer.\n\nAnd he would severely lighten his sitting for the first Tashahhud, and would say the first Taslīm out loud, to the point that everyone who was present would hear it.",
            "part_number": 1,
            "part_page": 36,
            "title": "al-Alam'ul Aliyyah fi Manaqib Ibnu Taymiyyah",
            "url": "https://t.me/ilmtest/68"
        },
        {
            "author": "Ibn Abī Ḥātim",
            "body": "There was a blind man who used to sit with Sufyān (ath-Thawrī). When it was Ramadan, the man would go lead the people in prayer, and they would give him clothes and gifts as a reward for this. So, Sufyān said: “On the Day of Resurrection, the people of the Qur'ān will come with their Qur'ān, and it will be said to the likes of this person: ‘You have already received your reward previously.’” So, the man said to him: “O Aba ‘Abdillah, you say this while I am sitting right next to you?” Sufyān replied: “I fear that it will be said to me on the Day of Resurrection that you were sitting next to me and I did not advise you.”",
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 99,
            "title": "al-Jarḥ wa ʾl-Taʿdīl",
            "url": "https://t.me/ilmtest/70"
        },
        {
            "author": "Abū Nuʿaym al-ʾAṣbahānī",
            "body": "One time, al-A'mash went out in the morning and passed by the mosque of Bani Asad.\n\nThey were about to start praying, and he went inside and prayed.\n\nThe Imām recited 'Al-Baqarah' in the first rak'ah, and recited 'Al 'Imran' in the second.\n\nWhen he finished, al-A'mash said to him: \"Will you not fear Allāh? Did you not hear that the Messenger of Allāh ﷺ said: \"Whoever leads the people in prayer should go easy, as there are those behind him who are old, weak, and have needs to tend to.\"\"\n\nSo, the man said: \"Allāh Said: {\"…and it is heavy except on those who have khushu'…\"} [al-Baqarah; 45]\n\nSo, al-A'mash said: \"I am a messenger sent from those who have khushu' telling you that you are heavy.\"",
            "part_number": 5,
            "part_page": 53,
            "title": "Ḥilyah al-Awliyāʾ",
            "url": "https://t.me/ilmtest/105"
        },
        {
            "after": {
                "events": ["sunrise"]
            },
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "And from it – i.e the rulings concerning masājid – is that if a person enters a masjid then he does not sit down until he prays two raka’ahs. He does not sit down until he prays two raka’ahs regardless of what time he enters [the masjid] whether in the morning, afternoon, night, day, sunrise or sunset whatever the time might be. Because the Prophet said: \"If anyone amongst you enters the masjid, then he should not sit down until he prays two raka’ahs.\" [Reported by Bukhārī, Kitaab al-Tahajud no. 1163 and Muslim, Kitaab Salaat-ul-Mūsāafireen no. 70 and Aḥmad in his Musnad 311/5] So much so, that the Prophet ﷺ was delivering a sermon to the people on a Friday and a man came and sat down, So the Prophet ﷺ stopped his sermon and addressed the man saying: \"Have you prayed?\" The man replied: No. The Prophet ﷺ said: Stand up and pray two raka’ahs and hasten them. [Reported by Aḥmad in al-Musnad 302/3, Tabarānī in al-Kabeer 193/7 and Ibn Khuzaymah in his Sahīh 1453] [So the Prophet ﷺ ordered him to hasten in the prayer] in order for him to listen to the sermon [attentively] Based on this hadīth some of the ‘ulamā [scholars] have said that the two raka’ahs prayed upon entering the masjid is in fact wājib (obligatory) Because the Prophet ﷺ ordered this man to pray the two raka’ahs even though he’d be busy from listening to the sermon, And listening to the sermon is wājib in itself, and you would not be occupied from a wājib unless the thing your occupied with is a higher degree of wājib. So because of this some scholars have reached the conclusion that if a person enters a masjid and he is in the state of wudhu and sits down and does not pray then he is sinning.",
            "days": [5],
            "part_number": 6,
            "part_page": 441,
            "title": "Sharḥ Riyaḍ al-Ṣāliḥīn",
            "url": "https://t.me/ilmtest/130"
        },
        {
            "author": "al-Ḏahabī",
            "body": "Ibn `Abbās (radiAllāhu `anhu) said: There are three verses in the Qur'ān which are associated with three things and none is accepted if the other is missing.\n\nThe first one: Allāh says {obey Allāh and obey the Messenger}; so whomever obeys Allāh but disobeys the Messenger ﷺ, his obedience to Allāh will not be accepted.\n\nThe second one: Allāh says {Offer salāt and give zakāt}; so whoever offers salāt but refuses to give zakāt. Allāh will not accept from him.\n\nThe third one: Allāh says {Give thanks to Me and to your parents}; so whoever gives thanks to Allāh and does not give it to his parents, Allāh will not accept that from him.",
            "part_number": 1,
            "part_page": 40,
            "title": "al-Kabāʾir",
            "url": "https://t.me/ilmtest/111"
        },
        {
            "after": {
                "events": ["sunrise"]
            },
            "author": "al-Ḏahabī",
            "body": "Imām Abū Muḥammad ‘Abdullāh ibn Muḥammad (the father of Abī Bakr ibn Al-'Arabī) reported:\n\nIbn Hazm told me the reason why he started seeking knowledge (fiqh).\n\nI (Ibn Hazm) attended a Janāzah (funeral) prayer and entered the masjid and sat down without praying two rak’aat,\n\nA man told me stand up and pray Tahyi-atul masjid!\n\nThis was at the age of 26,\n\nSo I stood up and prayed.\n\nThen when we returned from the Janāzah and I entered the masjid.\n\nI stood up (once more) to pray two rak’āt\n\nAnd I was told: Sit down! Sit down! This is not the time to pray! – it was after ‘Asr.\n\nSo I left in a sad state, and said to my teacher who had raised me, show me the house of the Faqīh (scholar) Abū ‘Abdillāh ibn Dahhūn.\n\nSo I went to him and told him of what had happened to me, so he guided me to al-Muwatta of Imām Mālik.\n\nSo I started studying it with him.\n\nI read it to him and others for about three years before I began to debate.",
            "days": [5],
            "part_number": 18,
            "part_page": 199,
            "title": "Siyar Aʿlām al-Nubalāʾ",
            "url": "https://t.me/ilmtest/136"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "before": {
                "events": ["fajr"]
            },
            "body": "The Prophet ﷺ said: “There are two dawns. One is called the tail of the wolf, which is the false dawn that appears vertically, not horizontally. The other appears horizontally and not vertically.”",
            "part_number": 5,
            "part_page": 8,
            "title": "Silsilah al-Aḥādīth al-Ṣaḥīḥah",
            "url": "https://t.me/ilmtest/194"
        },
        {
            "author": "Ibn Abi Dunyā",
            "body": "Sa'īd ibn 'Abdulazīz reported that Mak'hūl said: “I saw a man crying in his prayer and accused him of Ar-Riyā' (showing off); as a result, I was deprived of crying (for the sake of Allāh) for a year.”",
            "part_number": 1,
            "part_page": 63,
            "title": "Al-'Uqūbāt",
            "url": "https://t.me/ilmtest/198"
        },
        {
            "author": "Ibn Qayyim",
            "body": "Imām Aḥmad (may Allāh be pleased with him) said: “Patience is mentioned in the Qur’ân around ninety times.”\nPatience, or patient perseverance, is obligatory, according to the consensus of the scholars,\nAnd it is half of faith (îmân),\nBecause faith is two halves: one half is patience, and the the other half of which is gratitude (shukr).\nAnd it is mentioned in the Qur'ān in sixteen different forms.\nThe first: “O you who believe! seek help with patient perseverance (sabr) and prayer…” (Al-Baqarah 2:153)",
            "part_number": 2,
            "part_page": 151,
            "title": "Madārij as-Sālikīn",
            "url": "https://t.me/ilmtest/203"
        },

        {
            "author": "al-Bukhārī",
            "body": "“Straighten your rows for I see you from behind my back.”\nAnas added, “Everyone of us used to put his shoulder with the shoulder of his companion and his foot with the foot of his companion.”",
            "part_number": 1,
            "part_page": 146,
            "title": "al-Jāmiʿ al-Musnad al-Ṣaḥīḥ",
            "url": "https://t.me/ilmtest/342"
        },
        {
            "author": "ʿAbd al-ʿAzīz b. ʿAbd Allah b. Bāz",
            "body": "The question [paraphrased]: Some people who worked in the Saudi Arabian Embassy in Pakistan fasted with the Kingdom of Saudi Arabia, and some others fasted along with the people in Pakistan (as there is a difference in when each country began their fast). Which one should the people fast with (the local moonsighting or the global)?\nThe answer:\nThe evidence from the religion indicates,\nEvery person who is established in a land, then he fasts along with the people in that land when they fast.\nThe Prophet ﷺ said: “The fasting begins the day you all fast, and the Day of fiṭr is the day you all break your fast and the Day of Aḍḥá is the day you all slaughter.” [Tirmiḏī #697, Ibn Mājah #1660]\nAnd also due to what is known from the Sharīʿah of the order to stick together and the warning against differing.\nThe phases of the moon are different for each country (some of the countries have different moon-sightings) as expounded upon by Shaykh al-Islām Ibn Taymiyyah, may Allah have mercy on him.\nThus the people who had started their fast along with the people in Pakistan are more correct and closer to the truth than those who fasted along with those in Saudiyyah (there was a difference in the sightings that year).\nDue to the distance that is between these two countries and the fact that they can have possibly two different sightings of the moon.\nAnd there is no doubt that the fasting of the Muslims all together with one sighting or continuing to count Shaʿbān until you reach 30 (days) all the Muslims together no matter what country you are in, this is what is better due to the generality of the evidences.\nHowever when that is not possible then the closest and best thing to do is to do what I mentioned previously,\nAnd Allah is the One responsible for granting success.\nWa ʿl-salāmu ʿalaykum wa raḥmatullāhi wabarakāthu.",
            "hijri_dates": [29],
            "hijri_months": [8, 9],
            "part_number": 15,
            "part_page": 98,
            "title": "Majmūʿ al-Fatāwá",
            "url": "https://t.me/ilmtest/336"
        },
        {
            "author": "Abū Dāwūd al-Sijistānī",
            "body": "'Abdullāh bin 'Umar reported that the Messenger of Allāh ﷺ said:\n\n“Perfect (straighten) the rows,\n\nAnd stand shoulder to shoulder,\n\nAnd leave no gaps,\n\nAnd be gentle with the hands of your brothers,\n\nAnd do not leave gaps for Shaytān.\n\nWhoever connects a row, Allāh will connect him (with His Mercy),\n\nAnd whoever severs a row, Allāh will sever (His Mercy) from him.”\n\nAbū Dāwūd said: Abū Shajarah (one of the narrators) is Kathīr bin Murrah.\n\nAbū Dāwūd said: And the meaning of “Be gentle with the hands of your brothers”\n\nIs that if a person comes to a row and wishes to enter it, then every person should ease (space) for him so that he can stand in the row.",
            "part_number": 1,
            "part_page": 178,
            "title": "Sunan",
            "url": "https://t.me/ilmtest/343"
        },
        {
            "author": "Shams al-Haqq ʿAthīm Abādī",
            "body": "These ahādīth clearly indicate the importance of making the rows straight,\nWhich is part of the perfection of prayer;\nThey indicate that people should not stand back (from the row) or in front of (the row),\nAnd that they should stand shoulder to shoulder, foot to foot and knee to knee with their neighbours.\nBut nowadays this Sunnah is being ignored!\nIf someone does this nowadays the people shy away from him like Zebras!\nVerily to Allāh we belong and unto Him is our return.",
            "part_number": 2,
            "part_page": 256,
            "title": "ʿAwn al-Maʿbūd Sharh Sunan Abī Dāwūd",
            "url": "https://t.me/ilmtest/344"
        },
        {
            "author": "Bakr ibn ʿAbdillāh Abū Zayd",
            "body": "One of the new things that we see some people doing, with no evidence in Sharī’ah:\n\nIs that in prayer they try to align themselves with a person on the right if they are on the right hand side of the row,\n\nOr to align themselves with a person on their left if they are on the left hand side of the row,\n\nAnd they turn their feet inward so that their ankles are touching the ankles of the people next to them.\n\nThis is something for which there is no basis in Sharī'ah,\n\nAnd it is going to the extreme in implementing the Sunnah.\n\nThis is wrong on two counts.\n\nFirstly: The alignment of the row should begin from where the Imām is standing.\n\nWhoever is on the right of the row should align himself by looking at those who are to his left (i.e. closer to the Imām).\n\nThus the line will be straightened and the gaps will be filled. Alignment is done by lining up necks, shoulders and ankles, and by completing the front rows.\n\nBut to try to spread the legs wide and turn the feet inward so that one's ankles touch one’s neighbours’ ankles is an obvious mistake and an exaggeration,\n\nAnd a new interpretation which is indicative of going to extremes in trying to apply the Sunnah.\n\nIt causes annoyance and is not prescribed in Sharī’ah, and it widens the gaps between people standing in prayer.\n\nThat becomes apparent when the people prostrate, and when they stand up again they become distracted in trying to fill the gaps,\n\nAnd turning their feet to make their ankles touch their neighbours’ ankles, which makes them miss out on what they should be doing, which is to make the toes point in the direction of the Qiblah.\n\nDoing that is like competing with one’s neighbour and trying to take his place.\n\nAll of that is not prescribed in Sharī'ah.",
            "part_number": 1,
            "part_page": 12,
            "title": "La Jadid fi Aḥkām al-Salāt",
            "url": "https://t.me/ilmtest/345"
        },
        {
            "author": "Muḥammad Nāṣir al-Dīn al-Albānī",
            "body": "Abū Hurayrah (may Allāh be pleased with him) reported that the Prophet ﷺ said:\n\n“Make good your standing in the rows during prayer.”",
            "part_number": 1,
            "part_page": 334,
            "title": "Sahīh Targhīb wa Tarhīb",
            "url": "https://t.me/ilmtest/346"
        },
        {
            "author": "Imam Muslim",
            "body": "Nu'man b. Bashir reported: I heard the Messenger of Allah (ﷺ) say: Straighten your rows, or Allah would create dissension amongst you.",
            "part_number": 1,
            "part_page": 324,
            "title": "Sahīh Muslim",
            "url": "https://t.me/ilmtest/347"
        },
        {
            "author": "Imām An-Nawawī",
            "body": "“Its meaning is that enmity and hatred will be cast among you as well as a differing of the hearts,\n\nAs is said that: ‘so and so’s face changed towards me.’ Meaning: there became apparent to me from his face a dislike for me, and his heart changed towards me.\n\nSince their differing in the rows is a differing of their outwardness, and the outward differing is a reason for inward differing.”",
            "part_number": 4,
            "part_page": 157,
            "title": "Sharh Sahīh Muslim",
            "url": "https://t.me/ilmtest/348"
        },
        {
            "author": "Muḥammad ibn Sāliḥ al-ʿUthaymīn",
            "body": "He ﷺ said: “Straighten your rows, or Allāh would create dissension amongst you.”\n\nMeaning: between the viewpoints in your outlook – such that your hearts will differ,\n\nAnd this is without doubt a threat to the one who leaves off straightening,\n\nDue to this; some of the people of knowledge hold the obligation of straightening the row.\n\nThey corroborate that with: the command of the Prophet ﷺ with it,\n\nAnd his threat over its contravention,\n\nAnd so something which has come with a command for it; as well as a threat over its contravention, then it is not possible for it to be said that: it is merely a Sunnah (optional procedure).\n\nDue to this; the outweighing view in this issue is the obligation of straightening the rows,\n\nAnd that if the congregation do not straighten the row; then they are sinful,\n\nAnd this is what is apparent from the speech of Shaikh al-Islām Ibn Taymiyyah (rahimahullaah).",
            "part_number": 3,
            "part_page": 10,
            "title": "Ash-Sharh al-Mumtī",
            "url": "https://t.me/ilmtest/349"
        },
        {
            "author": "ʿAbd al-ʿAzīz bin ʿAbdAllāh bin Bāz",
            "body": "Movement within the prayer in order to fill any gaps – does this affect the prayer or not?\n\nAnswer: Filling them is legislated and movement in that is legislated and does not affect the prayer.\n\nSo if there is a gap in the row and the person draws his brother in order to come close until the gap is filled, or that a person comes from behind him – from the row next to theirs and so fills the gap – then all of this is legislated.\n\nThat does not affect the prayer,\n\nRather it is from the completion of the prayer and its perfection,\n\nSince the Messenger ﷺ commanded with filling the gaps in the rows.",
            "part_number": 12,
            "part_page": 202,
            "title": "Majmū’ al-Fatāwā",
            "url": "https://t.me/ilmtest/350"
        },

        {
            "author": "Ibn al-Qūdāmah al-Maqdisee",
            "body": "'Abdullāh ibn Aḥmad reported that he heard his father (Imām Aḥmad) supplicate in his prostration:\n\n“Oh Allāh as you have protected my face from prostrating to other than You, protect my face from asking other than You.”",
            "part_number": 1,
            "part_page": 392,
            "title": "Al-Mughnî",
            "url": "https://t.me/ilmtest/363"
        },
        {
            "author": "Muhammad ibn Nāsir al-Marwazī",
            "body": "An Imām said: “I will lead you people in Ramadān for a certain amount of money.”\n\nImām Aḥmad said: “I ask Allāh's pardon, who would pray behind this man?”",
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 246,
            "title": "Mukhtasar Qiyām al-Layl",
            "url": "https://t.me/ilmtest/376"
        },

        {
            "author": "Imām An-Nawawī",
            "body": "Al-Mutawallī and other than him said:\n\n“If the fasting person rinses his mouth he has to spit out the water,\n\nHe does not have to dry his mouth with a piece of cloth or the like.\n\nWe know of no ikhtilāf (scholarly dispute) on this.”",
            "hijri_months": [9],
            "part_number": 6,
            "part_page": 327,
            "title": "Majmū’ Sharh Muhaddhab",
            "url": "https://t.me/ilmtest/382"
        },

        {
            "after": {
                "events": ["isha"]
            },
            "author": "Ibn Hibbān",
            "body": "Ibn Umar reported: The Messenger of Allāh ﷺ said, “Whoever goes to sleep in a state of purity will have an angel over his head and he will not awaken until the angel says: O Allāh, forgive your servant for he has slept with ablution.”",
            "part_number": 3,
            "part_page": 328,
            "title": "Sahīh (Mukhrajah)",
            "url": "https://t.me/ilmtest/389"
        },

        {
            "author": "Al-Tabarānī",
            "body": "Ibn 'Umar (may Allāh be pleased with him) reported that the Prophet ﷺ said:\n\nThree things lead to destruction, and three things lead to salvation, three things lead to the expiation of sins and three things which raise you in levels:\n\nAs for the three things that lead to destruction they are:\n\n1. Stinginess which is obeyed.\n\n2. (Sinful) desires which are followed.\n\n3. And a person being amazed with himself (self admiration).\n\nAs for the three things which lead to salvation they are:\n\n1. Being just when angry or pleased.\n\n2. Being moderate when in poverty or in richness.\n\n3. And having fear of Allāh in secret and in open.\n\nAnd as for the things that lead to the sins being expiated they are:\n\n1. To wait for the next prayer after having prayed the previous prayer.\n\n2. Completing wudhū during severe cold.\n\n3. To walk to the congregational prayer.\n\nAnd as for the things that will raise you in levels they are:\n\n1. To feed the people.\n\n2. To spread the greeting of salām.\n\n3. And to pray at night whilst the people are asleep.",
            "part_number": 6,
            "part_page": 47,
            "title": "Al-Muj'am Al-Awsat",
            "url": "https://t.me/ilmtest/398"
        },

        {
            "after": {
                "events": ["isha"]
            },
            "author": "Ibn al-Jāwzī al-Hanbalī",
            "body": "Sayyār reported from Riyāh who said:\n\n“A woman was mentioned to me, so I married her.\n\nWhenever she finished praying 'Ishā, she would perfume herself, adorn herself with incense and wear her (fine) clothes;\n\nThen she would approach me and ask: ”Do you have a need?“\n\nIf I said yes,\n\nShe would stay with me.\n\nAnd if I said no,\n\nShe would take off her (fine) clothes and stand up for (prayer) until the morning.\n\nRiyāh said: ”By Allāh, she really delighted me.\"",
            "part_number": 2,
            "part_page": 255,
            "title": "Sifat as-Safwa",
            "url": "https://t.me/ilmtest/400"
        },
        {
            "author": "Imam al-Bukhārī",
            "body": "Narrated Ibn `Abbas: The Prophet (ﷺ) said, \"I have been ordered to prostrate on seven bones i.e. on the forehead along with the tip of the nose and the Prophet (ﷺ) pointed towards his nose, both hands, both knees and the toes of both feet and not to gather the clothes or the hair.\"",
            "part_number": 1,
            "part_page": 162,
            "title": "Ṣaḥīḥ al-Bukhārī",
            "url": "https://t.me/ilmtest/408"
        },
        {
            "author": "ʿAbd al-ʿAzīz bin ʿAbdAllāh bin Bāz",
            "body": "Question: The sister Umm 'Abdis Salām asks,\n\n“The person that prays in a chair due to his inability,\n\nIs it obligatory that there be a difference between his rukū' and his sujūd from the standpoint of placement of the hands and bending of the back,\n\nMay Allāh reward you with good?”\n\nAnswer: “It is obligatory for the one who prays sitting on the ground or in a chair to make his sujūd lower than his rukū',\n\nAnd it is the Sunnah to place his hands on his knees while in rukū;\n\nAs for sujūd then it is obligatory to place the hands on the ground if he is able.",
            "part_number": 12,
            "part_page": 245,
            "title": "Majmū’ al-Fatāwā",
            "url": "https://t.me/ilmtest/409"
        },

        {
            "author": "Imam Qurtubi",
            "body": "(Ar-Rabī') Ibn Subayh (al-Basrī) said:\n\n“A man complained to Al-Hasan al-Basrī about drought.\n\nHe said to him: ‘Seek Allāh’s forgiveness.’\n\nAnother man complained to him about poverty.\n\nSo he said to him: ‘Seek Allāh’s forgiveness.’\n\nAnother man said to him: ‘Supplicate to Allāh that He blesses me with a child.’\n\nHe said to him: ‘Seek Allāh’s forgiveness.’\n\nAnother man complained to him that his garden was dry;\n\nSo he said to him: ‘Seek Allāh’s forgiveness.’\n\nThus we asked him about this (advice).\n\nHe said: ‘I did not say anything from my personal opinion,\n\nVerily Allāh the Exalted says in Sūrah Nuh:\n\n{Ask forgiveness from your Lord, verily, He is Oft‑Forgiving; He will send rain to you in abundance. (And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers)}.’” [An-Nūh 71: 10-12]",
            "part_number": 18,
            "part_page": 302,
            "title": "Tafṣīr al-Qurṭubī",
            "url": "https://t.me/ilmtest/410"
        },

        {
            "author": "Imam Muslim",
            "body": "Zirr (b. Hubaish) reported: I heard from Ubayy b. Ka'b a statement made by 'Abdullah b. Mas'ud in which he said: He who gets up for prayer (every night) during the year will hit upon Lailat-ul-Qadr. Ubayy said: By Allah, the One whom there is no diety worthy of worship besides that (Lailat-ul-Qadr) is in Ramadhan (He swore without reservation: ) By Allah, I know the night; it is the night on which the Messenger of Allah (ﷺ) commanded us to pray. It is that which precedes the morning of twenty-seventh and its indication is that the sun rises bright on that day without rays.",
            "hijri_dates": [27],
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 525,
            "title": "Ṣaḥīḥ Muslim",
            "url": "https://t.me/ilmtest/413"
        },
        {
            "author": "Imām An-Nawawī",
            "body": "“The hadīth of Ubayy ibn Ka‘b says that he used to swear that it (Laylatul Qadr) was the night of the 27th,\n\nBut this is one of multiple opinions concerning it.\n\nMost of the 'ulamā (scholars) are of the view that it is an unknown night among the last ten nights of Ramadān,\n\nAnd it is most likely to be on an odd-numbered night, and the most likely night is the night of the 27th,\n\nOr the 23rd,\n\nOr the 21st.\n\nBut the majority of them are of the opinion that it is a specific night that does not move.\n\nHowever, some scholars held that it does move (from one day to another).\n\nSo in one year it may be the night of the 27th,\n\nAnd in another year it may be the night of the 23rd,\n\nAnd in another year it may be the night of the 21st,\n\nOr some other night,\n\nAnd this is what is most apparent (more likely to be correct).\n\nIn this way we may reconcile among the different ahadīth.”",
            "hijri_dates": [21, 23, 27],
            "hijri_months": [9],
            "part_number": 6,
            "part_page": 43,
            "title": "Sharh Sahīh Muslim",
            "url": "https://t.me/ilmtest/414"
        },

        {
            "author": "Muḥammad Nāṣir al-Dīn al-Albānī",
            "body": "On the authority of Anas (may Allāh be pleased with him), the Messenger of Allāh ﷺ said:\n\n“Whilst I was sleeping two men came to me.\n\nThey took my by the arm and brought me to a steep rocky mountain.\n\nThey said, ‘Climb up.’\n\nI said, ‘I cannot.’\n\nThey said, ‘We will make it easy for you.’\n\nSo I climbed up until I was at the top of the mountain.\n\nThen I heard loud voices.\n\nI said, ‘What are these voices?’\n\nThey said, ‘This is the howling of the people of the Hellfire.”\n\nThen I was taken until I saw people hanging by their hamstrings, with the sides of their mouths torn and blood pouring from their mouths.’\n\nI said, ‘Who are these?’\n\nHe said, ‘These are people who broke their fast before it was time.’”",
            "hijri_months": [9],
            "part_number": 2,
            "part_page": 611,
            "title": "Ṣaḥīḥ Targhīb wa Tarhīb",
            "url": "https://t.me/ilmtest/422"
        },
        {
            "author": "Muḥammad Nāṣir al-Dīn al-Albānī",
            "body": "I say: This is the punishment of those who fasted then broke the fast deliberately before the time for breaking the fast came,\n\nSo what about those who do not fast at all!?\n\nWe ask Allāh to keep us safe and sound in this world and in the Hereafter.",
            "hijri_months": [9],
            "part_number": 7,
            "part_page": 1671,
            "title": "as-Silsilah as-Ṣaḥīḥah",
            "url": "https://t.me/ilmtest/423"
        },

        {
            "author": "Imam al-Sa'dī",
            "body": "The one who is unable to fast due to old age or an illness from which there is no hope of recovery; then he is to feed a poor person for every day.",
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 113,
            "title": "Manhaj as-Sālikīn",
            "url": "https://t.me/ilmtest/424"
        },
        {
            "author": "Imam al-Sa'dī",
            "body": "He ﷺ forbade from fasting on two days: “…the Day of ('Eid) Fitr and the Day of Nahr.” [Agreed upon]",
            "hijri_dates": [1, 10],
            "hijri_months": [10, 12],
            "part_number": 1,
            "part_page": 115,
            "title": "Manhaj as-Sālikīn",
            "url": "https://t.me/ilmtest/425"
        },

        {
            "author": "al-Khaṭīb al-Baghdadī",
            "body": "Wakī' ibn al-Jarrah said:\n\n“Zakat al-Fitr is to Ramadān as Sujūd as-Sahw is to Salāt (the prayer),\n\nIt makes up for the shortcomings in Ramadān just as the latter makes up for shortcomings in the Salāt.”",
            "hijri_dates": [21, 22, 23, 24, 25, 26, 27, 28, 29],
            "hijri_months": [9],
            "part_number": 11,
            "part_page": 576,
            "title": "Tārikh Baghdād",
            "url": "https://t.me/ilmtest/436"
        },
        {
            "author": "Muḥammad Nāṣir al-Dīn al-Albānī",
            "body": "Saʿīd b. Al-Mūsāyyib – Allāh have mercy on him – said:\n\nThe Sunnah of Al-Fiṭr consists of three things:\n\nWalking to the prayer place (muṣallā),\n\nEating before leaving [for the prayer],\n\nAnd taking a full bath.\n\nThe chain of narration is Ṣaḥīḥ.",
            "hijri_dates": [1],
            "hijri_months": [10],
            "part_number": 3,
            "part_page": 104,
            "title": "Ṣaḥīḥ Irwā Al-Ghalīl",
            "url": "https://t.me/ilmtest/437"
        },
        {
            "author": "Muḥammad Nāṣir al-Dīn al-Albānī",
            "body": "On the authority of Abū Hurairah, who reports the Prophet ﷺ as saying, “Allāh created the land on Saturday;\n\nHe created the mountains on Sunday;\n\nHe created the trees on Monday;\n\nHe created the things entailing labour on Tuesday;\n\nHe created the light (or fish) on Wednesday;\n\nHe scattered the beasts in it (the earth) on Thursday;\n\nAnd He created Ādam after the afternoon of Friday,\n\nThe last creation at the last hour of the hours of Friday,\n\nBetween Al-'Asr (the afternoon) and night.”",
            "days": [5],
            "part_number": 4,
            "part_page": 449,
            "title": "as-Silsilah as-Ṣaḥīḥah",
            "url": "https://t.me/ilmtest/476"
        },
        {
            "author": "Abu Bakr Al-Humaydī",
            "body": "The person is not declared to be a disbeliever based upon sins.\n\nDisbelief is only due to abandoning the five things which the Prophet ﷺ mentioned in his statement:\n\nIslām is built upon five:\n\nThe testimony that nothing has the right to be worshipped except for Allāh and Muḥammad is the Messenger of Allāh,\n\nEstablishing the prayer,\n\nPaying the Zakat,\n\nFasting the month of Ramadān,\n\nAnd Hajj to the house.",
            "part_number": 1,
            "part_page": 7,
            "title": "Usūl as-Sunnah",
            "url": "https://t.me/ilmtest/500"
        },

        {
            "author": "Ibn Rajab",
            "body": "Sufyān Ath-Thawrī (may Allāh have mercy on him) said: “Your coming to the prayer before the iqāmah is a showing of respect for the prayer.”",
            "part_number": 5,
            "part_page": 353,
            "title": "Fath al-Bārī",
            "url": "https://t.me/ilmtest/523"
        },

        {
            "after": {
                "events": ["middleOfTheNight"]
            },
            "author": "Imām al-Dhahabī",
            "body": "Al-Qāsim bin Ma'n (rahimahullāh) narrated:\n\nIndeed, Abū Hanīfah (rahimahullāh) stood up all night whilst repeating the statement of Allāh:\n\n“Nay, but the Hour is their appointed time (for their full recompense), and the Hour will be more grievous and more bitter.” [Sūrah Al-Qamar: 46]\n\nAnd he wept\n\nAnd humbled himself until Fajr.",
            "part_number": 1,
            "part_page": 23,
            "title": "Manāqib al-Imām Abī Ḥanīfah",
            "url": "https://t.me/ilmtest/621"
        },
        {
            "author": "Muhammad ibn 'Īsā at-Tirmidhī",
            "body": "`Amr bin Shu`aib narrated from his father, from his grandfather, that the Prophet ﷺ said:\n\n“The best of supplication is the supplication of the Day of `Arafah.\n\nAnd the best of what I and the Prophets before me have said is:\n\nNone has the right to be worshipped but Allāh,\n\nAlone, without partner,\n\nTo Him belongs all that exists, and to Him belongs the Praise,\n\nAnd He is powerful over all things. (Lā ilāha illallāh, waḥdahu lā sharīka lahu, lahul-mulku wa lahul-ḥamdu, wa huwa `alā kulli shai’in qadīr).’”",
            "hijri_dates": [9],
            "hijri_months": [12],
            "part_number": 5,
            "part_page": 572,
            "title": "Sunan",
            "url": "https://t.me/ilmtest/623"
        },
        {
            "author": "Abu Nuaym al-Isfahani",
            "body": "Uthmān bin Hakīm (rahimahullāh) said: I heard Sa'īd Ibnul Mūsāyyib (rahimahullāh) saying: “For (a period of ) 30 years, the adhān was not called by the Mu-addhin except that I was in the masjid.”",
            "part_number": 2,
            "part_page": 162,
            "title": "Hilyatu Al-Awliyâ",
            "url": "https://t.me/ilmtest/638"
        },

        {
            "after": {
                "events": ["isha"]
            },
            "author": "Ibn Abī Ḥātim",
            "body": "Muḥammad bin Yūsuf (may Allāh have mercy on him) said: Sufyān ath-Thawrī (may Allāh have mercy on him) used to wake us up during the night and say: “Get up and pray O youth while you are still young!”",
            "part_number": 1,
            "part_page": 96,
            "title": "al-Jarḥ wa al-Taʿdīl",
            "url": "https://t.me/ilmtest/686"
        },
        {
            "after": {
                "events": ["fajr"]
            },
            "author": "ʿAbd al-ʿAzīz bin ʿAbdAllāh bin Bāz",
            "body": "Question: “Should the Ghusl for al-Jumu‘ah be done before (the time) of Fajr?”\n\nAnswer: “No, (this is not to be done) rather (it should be done) after (the time of) Fajr.\n\nAnd that which is better (is that he makes the ghusl) when he is about to leave for al-Jumu’ah.”",
            "days": [5],
            "part_number": 1,
            "part_page": 74,
            "title": "Masā'il Al-Imām ibn Bāz",
            "url": "https://t.me/ilmtest/704"
        },

        {
            "after": {
                "events": ["fajr"]
            },
            "author": "Muḥammad ibn 'Īsā al-Tirmithī",
            "body": "Anas bin Malik narrated that : the Messenger of Allah said: \"Whoever prays Fajr in congregation, then sits remembering Allah until the sun has risen, then he prays two Rak'ah, then for him is the reward like that of a Hajj and Umrah.\" He said: \"The Messenger of Allah said: 'Complete, complete, complete.'\"",
            "part_number": 2,
            "part_page": 481,
            "title": "Sunan",
            "url": "https://t.me/ilmtest/742"
        },

        {
            "author": "Al-Ṭabarānī",
            "body": "It was narrated that Abū Umāmah said: The Messenger of Allāh ﷺ said: “Whoever recites Āyat al-Kursī immediately after each prescribed prayer, there will be nothing standing between him and his entering Paradise except death.”",
            "part_number": 8,
            "part_page": 92,
            "title": "Al-Muj'am Al-Awsat",
            "url": "https://t.me/ilmtest/749"
        },

        {
            "author": "Abū Dāwūd al-Sijistānī",
            "body": "Abū Salāmah b. ʿAbd al-Raḥmān said that Zayd b. Khālid al-Juhanī said, “I heard the Messenger of Allāh ṣallallāhu ʿalayhi wa sallam say, ‘Had I not feared making matters difficult for my Ummah, I would have commanded them to use the siwāk at the time of every prayer.’” \n\nAbū Salāmah said, “I would see Zayd sit in the masjid with his siwāk (behind) his ear, in the same place that a scribe places his pen. Whenever he stood up to pray, he would use the siwāk.\"",
            "part_number": 1,
            "part_page": 12,
            "title": "Sunan",
            "url": "https://t.me/ilmtest/794"
        },
        {
            "author": "Muḥammad b. ʿĪsá al-Tirmiḏī",
            "body": "Saʿd narrated that the Messenger of Allāh ṣallallāhu ʿalayhi wa sallam said: \n\n“The supplication of Ḏī ʾl-Nūn while he was in the belly of the whale was, ‘Lā ilāha illā anta subḥānaka innī kuntu mina-dhālimīn’ (There is none worthy of worship except You. You are perfect in every way. I was indeed among those who perpetrated tremendous wrongdoing). \n\nNo Muslim supplicates for anything using this prayer except that Allāh would respond to him.”",
            "part_number": 5,
            "part_page": 529,
            "title": "Sunan",
            "url": "https://t.me/ilmtest/877"
        },

        {
            "after": {
                "events": ["lastThirdOfTheNight"]
            },
            "author": "Ibn Taymiyyah",
            "body": "Jābir b. ʿAbd Allāh said, \"I heard the Prophet –ﷺ– say, “Indeed, there is an hour from the night, which if a Muslim asks Allāh in that time from the good of the affairs of this world and the Hereafter, then Allāh gives him of it, and that is in every night.”\n\nAllāh ta'alá says: {And those who seek forgiveness before dawn} [Al-’Imrān 3:17]",
            "part_number": 1,
            "part_page": 88,
            "title": "Takhrīj al-Kalim al-Ṭayyib",
            "url": "https://t.me/ilmtest/931"
        },
        {
            "after": {
                "events": ["isha"]
            },
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "Questioner: “Is it permissible for the person following the Imām in prayer- especially in the Tarawīḥ prayer – to stand behind, holds the Musḥaf and follows the Imām by looking at it?”\n\nThe Shaykh: “No, this is not from the Sunnah.”\n\nQuestioner: “If he did this is his prayer accepted?”\n\nThe Shaykh: “His prayer is accepted.”\n\nQuestioner: “But we say it is against the Sunnah?”\n\nThe Shaykh: “Yes.”",
            "hijri_months": [9],
            "part_number": 679,
            "part_page": 14,
            "title": "Silsilah al-Hudá wa ʾl-Nūr",
            "url": "https://t.me/ilmtest/933"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "Abū Hurayrah (may Allāh be pleased with him) reported that the Prophet ﷺ said: “The prayer is the best of what has been prescribed, so he who is able to perform a great deal of it then let him do so.”",
            "part_number": 1,
            "part_page": 280,
            "title": "Ṣaḥīḥ ʾl-Tarġīb wa ʾl-Tarhīb",
            "url": "https://t.me/ilmtest/937"
        },
        {
            "author": "Imām al-Bukhārī",
            "body": "Abū Hurayrah narrated that the Prophet ṣallallāhu ʿalayhi wa sallam said: \n\n“The religion is easy. Whoever tries to contend with it will be overpowered, so follow a middle course, do the best you can, receive glad tidings, and seek help by worshipping Allāh in the early part of the day, in the afternoon, and during the last hours of the night.”",
            "part_number": 1,
            "part_page": 16,
            "title": "Ṣaḥīḥ al-Bukhārī",
            "url": "https://t.me/ilmtest/940"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "ʿUthmān b. Abī Al-ʿĀṣ (may Allāh be pleased with him) said he came complaining to the Prophet ﷺ saying: “The shayṭān comes between me and my ṣalāt (prayer) and causes me problems with my recitation.”\n\nSo the Messenger of Allāh ﷺ said: “That is a shayṭān called Khanzab, so if you feel his presence, seek refuge in Allāh and blow (a little) dry spit to your left three times.”\n\nHe (ʿUthmān) said: “I did that and Allāh took him away from me.”",
            "part_number": 1,
            "part_page": 167,
            "title": "Ṣaḥīḥ al-Tarġīb wa al-Tarhīb",
            "url": "https://t.me/ilmtest/1301"
        },
        {
            "author": "Ibn al-Qūdāmah al-Maqdisī",
            "body": "And performing the voluntary prayers in the house is preferable according to the statement of the Messenger of Allāh (ﷺ) “So perform prayer in your houses for verily the best prayer of a person is in his house, except for the obligatory prayers“, narrated by Muslim, and on the authority of Zayd b. Thābit that the Prophet (ﷺ) said, “the prayer of a person in his house is better than his prayer in my masjid, except for the obligatory prayers“, narrated by Abū Dāwūd. And he said, “When any one of you observes prayer in the masjid he should reserve a part of his prayer for his house, for Allāh would make the prayer as a means of betterment in his house“, narrated by Muslim. For (optional) prayer in the house is nearer to ikhlāṣ, and further removed from riyāʾ, and it is a secret action, and performing (optional) prayer in the masjid is public, and the secret action is better.",
            "part_number": 2,
            "part_page": 104,
            "title": "al-Muġnī",
            "url": "https://t.me/ilmtest/1481"
        },

        {
            "after": {
                "events": ["isha"]
            },
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "It is befitting for the person to pray the Witr prayer and to direct his family to carry it out too because many of the women at home and also children who have not read (into the subject) think that Witr is not an emphasized Sunnah. So we should convey to our families that Witr is an emphasized Sunnah which it is not befitting for the person to abandon it.",
            "part_number": 2,
            "part_page": 236,
            "title": "Fatḥ Ḏī ʾl-Jalāli wa ʾl-Ikrām bi Sharḥ Bulūġ al-Marām",
            "url": "https://t.me/ilmtest/1656"
        },
        {
            "author": "Al-Bayhaqī",
            "body": "And as for ṣalāt al-Jumuʿah (ie: the Friday prayer) then (Imām) Aḥmad, and the rest of the Imāms of al-Sunnah, used to pray behind al-aʾimmah al-jawr (ie: the tyrannical rulers) and anyone else.\n\nAs al-Shaʿbī said: “I met 500 from the Companions of the Prophet ﷺ, all of them used to pray behind al-aʾimmah al-jawr”",
            "days": [5],
            "part_number": 3,
            "part_page": 174,
            "title": "al-Sunan al-Kubrá",
            "url": "https://t.me/ilmtest/2022"
        },

        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "Ḥumayd reported that Maymūn asked Anas b. Mālik: “O Abū Ḥamzah! What renders the life and property of a person sacred?”\n\nHe replied: “Whoever says that there is none worthy of worship in truth except Allāh, faces our qiblah (ie: in the prayer), offers prayers like us, and eats animals slaughtered by us, then they are a Muslim; and will have the same rights and obligations granted to Muslims.”",
            "part_number": 7,
            "part_page": 1527,
            "title": "Silsilah al-Aḥādīth al-Ṣaḥīḥah",
            "url": "https://t.me/ilmtest/2025"
        },
        {
            "author": "Ibn al-Qūdāmah al-Maqdisī",
            "body": "There is no difference of opinion between scholars as to the disbelief of the one who abandons (the prayer) by denying its obligation, if a person like him cannot ignore (that it is obligatory).\n\nHowever, if a person like him does not know its obligation, like the one who has just converted to Islām, or who does not grow up in an Islāmic land, or in a desert far from the countries where you find ahl al-ʿilm (ie: scholars): he will not be judged to be a disbeliever.\n\nIt will first be necessary to inform him [the obligation of prayer] and to confirm to him the proofs of its obligation; if after that he keep denying the obligation: he becomes a disbeliever.\n\nBut if the one who denies the obligation is someone who grows up in a country where you find ahl al-ʿilm: he becomes a disbeliever as soon as he denies it.\n\nAnd it is the same for all pillars of Islām which are Zakāt, al-siyam (ie: fasting) and al-Ḥajj (ie: pilgrimage):\n\nBecause those are the pillars of Islām and the proofs of their obligatory character nobody barely misses this fact, as the Book and Sunnah are widely prevalent as well as their proofs.\n\nThe only one who can deny its obligation is someone who persists against Islām and refuses to commit to its law and to accept the Book of Allāh, Exalted be He, the Sunnah of His Prophet and the consensus of his ummah.",
            "part_number": 9,
            "part_page": 11,
            "title": "al-Muġnī",
            "url": "https://t.me/ilmtest/2027"
        },

        {
            "author": "Ibn Khuzaymah",
            "body": "While we were sitting in the masjid ʿAmmār (b. Yāsir) entered and offered the ṣalāh (ie: prayer). He kept it short. When he passed by us it was asked of him, “O father of Yaqdhān, you have kept your ṣalāh short.” He responded, “Do you find it short?” We said, “Yes.” He said, “As for me I have invoked in it a supplication which I heard (ie: learned) from the Prophet ﷺ.”\n\nThen he went on. Someone among us followed him. ʿAṭāʾ said that it was indeed his father (the first narrator in this chain) who followed ʿAmmār but narrates the incident as third person (saying someone among us followed him) only because he did not like to say that he himself followed the man.\n\nHe asked him (ie: ʿAmmār) about the supplication.\n\n(He learnt it from ʿAmmār) and came back. He told those present the following supplication: “O Allah, because of your knowledge of al-ġayb (ie: the unseen), and your power over the entire creations keep me alive till you know that life is good for me. Give me death when you know that death is better for me. O Lord, I seek you to make me fear you in presence (when I am in public or regarding things I commit which can be noticed) and in absence (when I am alone regarding things which relate to secretes of the hearts). I beseech you to let me speak the word of truth and justice both in the state of anger and happiness. I beseech you to make me adopt balanced approach when I am affluent and when I am destitute. Grant me wealth which cannot be annihilated. Grant me an unending delight of the eye. I seek your pleasure but prefer your decision regarding me. Grant me life of pleasure after you have given me death. I implore you to let me see Your Face. I ask You to grant me the enthusiasm for meeting You while free from inflicting harm or misguiding trial. O Allah, adorn us with the adornment of al-īmān (ie: faith) and make us the leaders of those seeking guidance.”",
            "part_number": 1,
            "part_page": 34,
            "title": "al-Tawḥīd",
            "url": "https://t.me/ilmtest/2107"
        },

        {
            "author": "Ibn al-Qayyim",
            "body": "And he (the Prophet) ﷺ would make a lot of Du'ā in the (first) 10 days of Dhul-Ḥijjah and he would command with the increase of (saying) Lā ilāha ill-Allāh, Allāhu Akbar and Alhamdulillāh.",
            "hijri_dates": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
            "hijri_months": [12],
            "part_number": 2,
            "part_page": 360,
            "title": "Zād al-Maʿād fī Hadyi Khayr al-ʿIbād",
            "url": "https://t.me/ilmtest/2481"
        },
        {
            "author": "Ibn ʿAbd al-Barr",
            "body": "And Dāwūd b. ʿAlī said: “Raising the hands at the takbirah al-iḥrām (ie: saying “Allahu akbar” when commencing the prayer) is wājib (ie: obligatory) and a rukn (ie: pillar) among the arkān (ie: pillars) of the Ṣalāt.”\n\nAnd his companions differed.\n\nSome of them said: “Raising the hands at the al-iḥrām, rukūʿ, and rising from rukūʿ, are all wājib.”\n\nWhile some of them said: “(None of that) is wājib, because they are actions of the Prophet ﷺ, and he did not command that we do them.”\n\nYet some of them said: “Only raising the hands at the [takbirah] al-Iḥrām is wājib'.\n\nAnd some of them said: ”All of it is wājib, due to his (ie: the Prophet ﷺ's) statement: “Wa ṣallu kamā raʿaitumunī uṣallī (ie: pray as you have seen me pray).”",
            "part_number": 1,
            "part_page": 409,
            "title": "Al-ʾIstiḏkār",
            "url": "https://t.me/ilmtest/2485"
        },

        {
            "author": "ʿAbd al-Razzāq al-Ṣanʿānī",
            "body": "From Ibn Juraij: From ʿAṭāʾ, who said: “Can a man pray while his mouth is covered?”\n\nHe answered: I prefer that he remove the covering from his mouth; I heard Abū Hurayrah say: “When you pray, you are conversing with your Lord.”",
            "part_number": 2,
            "part_page": 454,
            "title": "al-Muṣannaf",
            "url": "https://t.me/ilmtest/2821"
        },
        {
            "author": "ʿAbd al-Razzāq al-Ṣanʿānī",
            "before": {
                "events": ["maghrib"]
            },
            "body": "From Maʿmar: From al-Dhuhrī: From Ibn al-Musayyab, who said: “The Muhājirūn did not used to pray the two rakʿāt before Maġrib, while the Anṣār used to do so”.\n\nal-Zuhrī said: “And Anas used to pray them.”",
            "part_number": 2,
            "part_page": 435,
            "title": "al-Muṣannaf",
            "url": "https://t.me/ilmtest/2893"
        },
        {
            "author": "Aḥmad b. Ḥanbal",
            "body": "Anas b. Mālik, (may Allah be pleased with him) said: I prayed with the Messenger of Allah ﷺ as well as: Abū Bakr, ʿUmar, and ʿUthmān, and I did not hear anyone of them say: \"Bismillah Al-Raḥmān Al-Raḥīm (loudly when commencing al-Fātiḥah in the prayer).“",
            "part_number": 20,
            "part_page": 199,
            "title": "al-Musnad",
            "url": "https://t.me/ilmtest/3258"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "al-Ṭaḥāwī reported in Sharḥ al-Maʿānī, al-Bazzār in his Musnad, and al-Ṭabarānī reported in al-Muʿjam al-Awsaṭ that Abū Saʿīd al-Khudrī narrated that a man gave the salām to Allah’s Messenger ﷺ while he was in prayer, who then replied with a gesture. When he finished praying, he said to the man: “We used to reciprocate the salām (verbally) during our prayer, then we were prohibited from doing that.”",
            "part_number": 6,
            "part_page": 997,
            "title": "Silsilah al-Aḥādīth al-Ṣaḥīḥah",
            "url": "https://t.me/ilmtest/3259"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "Abū Qatādah (may Allah be pleased with him) reported that the Messenger ﷺ said: “Verily, I stand for prayer and intend to lengthen (recitation) within it but upon hearing the crying of a child I shorten it as I dislike to trouble his mother.”",
            "part_number": 1,
            "part_page": 489,
            "title": "Ṣaḥīḥ al-Jāmiʿ al-Ṣaġīr",
            "url": "https://t.me/ilmtest/3262"
        },
        {
            "author": "Abū ʿl-Walīd al-Bājī",
            "body": "Mālik: From Abū Ḥāzim b. Dīnār: From Sahl b. Saʿd al-Saʿīdi, who said: “The people used to be ordered; that a man place his right hand over his left arm during the prayer”.\n\nAbū Ḥāzim said: “I only know that he raised this statement (ie: attributed it to the Prophet ﷺ).”",
            "part_number": 1,
            "part_page": 281,
            "title": "al-Muntaqá Sharḥ al-Muwaṭṭaʾ",
            "url": "https://t.me/ilmtest/3313"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "Questioner: “If a man finishes praying and then remembers that he never had wuḍū, does he repeat the prayer or not?”\n\nThe Shaykh: “He repeats it.”",
            "part_number": 428,
            "part_page": 20,
            "title": "Silsilah al-Hudá wa ʾl-Nūr",
            "url": "https://t.me/ilmtest/3316"
        },
        {
            "author": "Abū Nuʿaym al-ʾAṣbahānī",
            "body": "Nāfiʿ reported that when Ibn ʿUmar (may Allah be pleased with him) would recite: {Has the time not come for hearts of those who have believed to be moved by the remembrance of Allah?} [57:16] he used to cry until he would be overcome by weeping.",
            "part_number": 1,
            "part_page": 305,
            "title": "Ḥilyah al-Awliyāʾ",
            "url": "https://t.me/ilmtest/3427"
        },
        {
            "after": {
                "events": ["dhuhr"]
            },
            "author": "ʿAbd al-Razzāq al-Ṣanʿānī",
            "body": "From Ibn Juraij: From ʿAṭāʾ: Who saw Ibn ʿUmar pray after al-Jumuʿah, (and he said):\n\n“[Ibn ʿUmar] would move away a little bit from the place he had initially prayed in, then pray two rakʿāt.\n\nThen he would walk away a little more, and pray four rakʿāt.”",
            "days": [5],
            "part_number": 3,
            "part_page": 246,
            "title": "al-Muṣannaf",
            "url": "https://t.me/ilmtest/3534"
        },
        {
            "author": "Ibn Taymiyyah",
            "body": "And takfīr of the one who leaves the prayer is mash-hūr (ie: well known) and has been transmitted from the majority of the Salaf from al-Ṣaḥābah (ie: the Companions) and the al-tābiʿīn (ie: their successors).",
            "part_number": 20,
            "part_page": 97,
            "title": "Majmūʿ al-Fatāwá",
            "url": "https://t.me/ilmtest/3537"
        },
        {
            "author": "ʿAbd al-Razzāq al-Ṣanʿānī",
            "body": "From Ibn Jurayj, who said: I asked ʿAṭāʾ: “What is your view on those people who lower their hands below their knees when in rukūʿ?” He said: “This is an innovation. No—[the hands] must be above the knees.”",
            "part_number": 2,
            "part_page": 150,
            "title": "al-Muṣannaf",
            "url": "https://t.me/ilmtest_research/126"
        },
        {
            "author": "Ibn Ḥazm",
            "body": "Issue: The ghusl of Friday relates to the day, not the prayer. If one prays the Friday prayer then ʿAṣr, then performs ghusl after that, it suffices him. The earliest time for this ghusl is from the entering of Fajr on Friday until the sun’s disc remains such that one can complete the ghusl before its setting; yet it is better to perform it connected to one’s departure for the prayer.",
            "days": [5],
            "part_number": 1,
            "part_page": 266,
            "title": "al-Muḥallá bi ʾl-Āthār",
            "url": "https://t.me/ilmtest/1451"
        },
        {
            "after": {
                "events": ["isha", "halfTheNight"]
            },
            "author": "Ibn Rajab",
            "body": "Al-Thawrī said: al-taʿqīb—dividing the Tarāwīḥ into the last portion of the night—is a newly invented matter. Some of our companions were certain of its dislike except after sleep or if delayed until after the middle of the night. They stipulated that Witr be prayed in congregation in the first night prayer. This is the statement of Ibn Ḥāmid and al-Qāḍī and their companions. Aḥmad did not stipulate that. Most jurists held that it is not disliked in any case. Al-Ḥasan disliked that the imām order the people with taʿqīb because of the hardship; he said: whoever has strength, let him do that for himself, not for the people.",
            "hijri_months": [9],
            "part_number": 9,
            "part_page": 175,
            "title": "Fatḥ al-Bārī",
            "url": "https://t.me/ilmtest_research/265"
        },
        {
            "author": "Ibn Abī Shaybah",
            "body": "ʿAffān narrated to us… that ʿAmr b. Dīnār said: “Ibn al-Zubayr, when he prayed, used to leave his hands hanging by his sides.”",
            "part_number": 1,
            "part_page": 344,
            "title": "al-Muṣannaf",
            "url": "https://t.me/ilmtest_research/156"
        },
        {
            "author": "Ibn al-Qayyim",
            "body": "The twenty-fifth point: Giving al-ṣadaqah (ie: charity on Friday) has a distinct advantage over the rest of the weekdays; and likewise, giving charity in the month of Ramaḍān in contrast to the rest of the months.",
            "days": [5],
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 394,
            "title": "Zād al-Maʿād fī Hadyi Khayr al-ʿIbād",
            "url": "https://t.me/ilmtest/3335"
        },
        {
            "after": {
                "events": ["sunrise"]
            },
            "author": "Ibn Rajab",
            "body": "Ibn Al-Musayyib said: “The day of al-Jumuʿah is more beloved to me than voluntary Ḥajj.”",
            "days": [5],
            "part_number": 1,
            "part_page": 175,
            "title": "Fatḥ al-Bārī",
            "url": "https://t.me/ilmtest/1939"
        },
        {
            "after": {
                "events": ["sunrise"]
            },
            "author": "Ibn Rajab",
            "body": "“I do not know of any difference of opinion on the recommendation of wearing one‘s best clothes for al-jumuʿah and ʿīd.”",
            "days": [5],
            "part_number": 8,
            "part_page": 119,
            "title": "Fatḥ al-Bārī",
            "url": "https://t.me/ilmtest/1412"
        }
    ]
}
