{
    "quotes": [
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "This is the best evidence for the recommendation to bath on the two ʿĪd celebrations, narrated by al-Bayhaqī:\nA man once asked ʿAlī – Allah be pleased with him – about taking a full bath (ġusl).\nHe replied, “Wash every day if you want.”\nThe man said, “No, what I mean is al-ġusl.”\nʿAli replied, “al-Jumuʿah (Friday), the Day of ʿArafah, the Day of al-Naḥr (sacrificial slaughter, ʿĪd al-Adhā) and the Day of al-Fiṭr (the ʿĪd following Ramaḍān).”\nThe chain of narration is authentic.",
            "hijri_dates": [29],
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 176,
            "title": "Irwāʾ al-Ġalīl fī Takhrīj Aḥādīth Manār al-Sabīl",
            "url": "https://t.me/ilmtest/388"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "From Abū Hurayrah (may Allah be pleased with him) who said: “There were two men from Baliyy, from the (tribe of) Qudā‘ah who accepted Islām and joined Allah‘s Messenger ﷺ.\nThen one of them was martyred and the other one died a year later.\nSo Ṭalhah b. ʿUbaydillāh (may Allah be pleased with him) said: I saw the one delayed (in a dream) and he was entered into Paradise before the martyr, so I was surprised at that. So I mentioned that to Allah’s Messenger ﷺ.\nSo Allah’s Messenger ﷺ said: “Did he not fast Ramaḍān after him, and pray six-thousand (more) rakʿahs, and such and such Sunnah prayers?”\nReported by Aḥmad with a Ḥasan chain of narration.\n[Ḥasan Ṣaḥīḥ]",
            "hijri_dates": [1],
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 273,
            "title": "Ṣaḥīḥ al-Tarġīb wa ʿl-Tarhīb",
            "url": "https://t.me/ilmtest/928"
        },
        {
            "author": "Ṣāliḥ al-Fawzān",
            "body": "O Muslims! A great month is at hand, and a noble guest will visit you soon: {The month of Ramaḍān in which was revealed the Qurʿān, a guidance for mankind and clear proofs for the guidance and the criterion (between right and wrong)} [Al-Baqarah 2:185]\nAllāh has ordained it‘s fast as one of the pillars of Islām, and standing during it’s night (for prayer) from the tremendous voluntary acts.",
            "hijri_months": [9],
            "title": "salihalfawzan",
            "url": "https://t.me/ilmtest/1214"
        },
        {
            "after": {
                "events": ["isha"]
            },
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "Question: Noble Shaykh, whoever prays the Tarāwīḥ (prayer) must he then continue to pray them all throughout Ramaḍān?\nAnswer: No he does not have to continue (to pray them) because it is a recommended (Sunnah) prayer in that if he prays them then he is rewarded and if he leaves them then he is not a sinner. However, (in leaving them) he misses out on a lot of good as we have said (before).",
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 254,
            "title": "Fiqh al-ʿIbādāt",
            "url": "https://t.me/ilmtest/1234"
        },
        {
            "author": "al-Shawkānī",
            "body": "Fasting the month of Ramaḍān is obligatory upon the sighting of the crescent by a trustworthy individual, or (in the case of the crescent not being sighted) by the month of Shaʿbān being completed. It is obligatory to fast for thirty days so long as the crescent of Shawwāl is not sighted before thirty days of Ramaḍān being completed. If the people of a particular land see and confirm the sighting of the crescent, it is upon the other countries to conform to this sighting. It is upon the fasting person to make the intention to fast before Fajr.",
            "hijri_dates": [28, 29],
            "hijri_months": [8],
            "part_number": 5,
            "part_page": 2490,
            "title": "al-Fatḥ al-Rabbānī",
            "url": "https://t.me/ilmtest/1707"
        },
        {
            "author": "Ibn al-Qūdāmah al-Maqdisī",
            "body": "Laylah al-Qadr is sought during the last ten nights of Ramaḍān,\nwith the odd nights being more likely,\nand the night of the twenty-seventh holding the greatest hope.\nOne should make the supplication narrated from ʿĀ'ishah, may Allah be pleased with her, who said, “O Messenger of Allah, if I find Laylah al-Qadr, what should I supplicate?”\nHe said: Say: “O Allah, You are Forgiving and love forgiveness, so forgive me.”",
            "hijri_dates": [21, 23, 25, 27, 29],
            "hijri_months": [9],
            "part_number": 1,
            "part_page": 106,
            "title": "al-Muqniʿ fī Fiqh ʿl-Imām Aḥmad",
            "url": "https://ilmtest.tumblr.com/post/747228500658962432"
        },
        {
            "author": "al-Nasāʾī",
            "body": "Ibn ʿUmar (may Allah be pleased with him) who said: The Messenger of Allah ﷺ enjoined zakāt al-fīṭr upon the people at the end of Ramaḍān, a ṣāʿ of dates or a ṣāʿ of barley, upon everyone, free or slave, male or female, among the Muslims.",
            "hijri_dates": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
            "hijri_months": [9],
            "part_number": 3,
            "part_page": 37,
            "title": "al-Sunan al-Kubrá",
            "url": "https://t.me/ilmtest/3877"
        },
        {
            "author": "Ibn Taymiyyah",
            "body": "Ibn ʿAbbās (may Allah be pleased with him) reported that the Messenger ﷺ said:\nJibrīl led me in Salāh twice at the House.\nSo he prayed al-Dhuhr the first day when the shadow was similar to the length of the strap of a sandal (just after midday).\nThen he prayed al-ʿAṣr when an object was similar to the length of its shadow.\nThen he prayed al-Maġrib when the sun had set and the fasting person breaks the fast.\nThen he prayed al-ʿIshāʾ when the twilight had vanished.\nThen he prayed al-Fajr when the true dawn began (before sunrise), and when eating is prohibited for the fasting person.\nThe second occasion he prayed al-Dhuhr when the shadow of everything was similar to the length of it, which was the time of al-ʿAṣr the day before.\nHe prayed al-ʿAṣr when the shadow of an object was about twice as long as it.\nThen he prayed al-Maġrib at the same time as he did the first time.\nThen he prayed al-ʿIshāʾ, the later one, when a third of the night had gone.\nThen he prayed al-Fajr when the land glowed (before sunrise).\nThen Jibrīl turned towards me and said: “O Muḥammad! These are the times of the Prophets before you,\nand the time is what is between these two times (for each prayer).”",
            "part_number": 1,
            "part_page": 150,
            "title": "Sharḥ al-ʿUmdah Kitāb al-Ṣalāh",
            "url": "https://t.me/ilmtest/4746"
        },
        {
            "after": {
                "events": ["maghrib", "fajr", "isha"]
            },
            "author": "Ibn al-Qayyim",
            "body": "This is why the Prophet ﷺ used to recite the two Sūrahs (al-Kāfīrūn and al-Ikhlāṣ) in the Sunnāh prayer of al-Fājr, wa ʿl-Maġrib wa ʿl-Wītr prayer, which commence and conclude one's actions [of the day and night], so that the day would begin with Tawḥīd and end with Tawḥīd.",
            "part_number": 2,
            "part_page": 94,
            "title": "Ijtimāʿ al-Juyūsh",
            "url": "https://t.me/ilmtest/4244"
        },
        {
            "after": {
                "events": ["maghrib", "asr"]
            },
            "author": "Ibn Taymiyyah",
            "body": "He (may Allah have mercy on him) was asked: “If a person missed the ʿAṣr (afternoon prayer), and when he arrived to the masjid he found maġrib (sunset prayer) has started, which prayer should he pray first?”\nAnswer (may Allah have mercy on him): All Praise is due to Allah, the Lord of all that exists. He should pray maġrib with the Imām (the one leading the prayer at the masjid), then pray al-ʿAṣr afterwards, as agreed upon by all leading scholars.\nHowever, should he repeat the maġrib prayer (after having prayed it with the Imām)?\nThis has two scholarly opinions.\nThe first is that he repeats. This is the saying of Ibn ʿUmar, Mālik, Abū Ḥanīfah and Aḥmad in what is most well-known about this issue.\nThe second opinion is that he does not repeat. This is the saying of Ibn ʿAbbās, the Shāfiʿī maḏhab, and the second opinion of the maḏhab of Imām Aḥmad.\nThe second opinion is more correct, for Allah did not make it obligatory on the person to pray a ṣalāh twice if he has feared Allah as much as he can.\nAnd Allah knows best.",
            "part_number": 22,
            "part_page": 106,
            "title": "Majmūʿ al-Fatāwá",
            "url": "https://t.me/ilmtest/1304"
        },
        {
            "after": {
                "events": ["asr", "fajr"]
            },
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "Exaltations/Supplications of the Morning and Evening\nQuestioner: “When is the time for making the morning and evening adhkār (exaltations/ supplications)?”\nal-Shaykh: “The morning adhkār are said after Fajr and the evening adhkār are said after ʿAṣr.”\nQuestioner: “Okay, what is the proof for this O Shaykh? We heard in Afġānistān that you said the evening adhkār are said after Maġrib?”\nal-Shaykh: “No, it is after ʿAṣr.”\nQuestioner: “Okay, what is the dalīl (proof) for this?”\nal-Shaykh: “Because al-masāʾ (ie: evening) linguistically starts after ʿAṣr.”",
            "part_number": 192,
            "part_page": 6,
            "title": "Silsilah al-Hudá wa ʾl-Nūr",
            "url": "https://t.me/ilmtest/696"
        },
        {
            "author": "Isḥāq al-Kawsaj",
            "before": {
                "diff": "1h",
                "events": ["maghrib"]
            },
            "body": "I asked (Imām Aḥmad): “When is the hour that is hoped for on Friday?”\nHe replied: Most of the ḥadīths indicate that it is after al-ʿAṣr.\nIsḥāq said: “After al-ʿAṣr — I hardly have any doubt about it, and I also hope for the time after the sun has passed its zenith.”",
            "days": [5],
            "part_number": 2,
            "part_page": 874,
            "title": "Masāʾil al-Imām Aḥmad wa Isḥāq Ibn Rahāwiyah",
            "url": "https://t.me/ilmtest/5400"
        },
        {
            "after": {
                "events": ["dhuhr", "asr"]
            },
            "author": "Aḥmad Shākir",
            "body": "And (Imām) Aḥmad said: Most of the aḥādīth about al-sāʿah (ie: the hour) in which it is hoped for al-duʿāʾ (ie: supplications) to be answered: it is after ṣalāt al-ʿAṣr, and it is hoped (too) after the sun has passed its zawāl (ie: zenith).",
            "part_number": 7,
            "part_page": 406,
            "title": "Musnad Aḥmad",
            "url": "https://t.me/ilmtest/4884"
        },
        {
            "author": "ʿAbd al-Muḥsin al-ʿAbbād",
            "before": {
                "diff": "1h",
                "events": ["maghrib"]
            },
            "body": "Jābir b. ʿAbd Allah (may Allah be pleased with him) that the Prophet ﷺ said:\n“Friday is divided into twelve hours.\nAmongst them there is an hour,\nIn which a Muslim does not ask Allah the Mighty and Majestic for anything but He the Mighty and Majestic gives it to him.\nSo seek it in the last hour after al-ʿAṣr (ie: the afternoon prayer).”",
            "part_number": 133,
            "part_page": 8,
            "title": "Sharḥ Abī Dāwūd",
            "url": "https://t.me/ilmtest/3320"
        },
        {
            "after": {
                "events": ["asr"]
            },
            "author": "Ibn ʿAbd al-Barr",
            "body": "Whenever Saʿīd (b. Jubayr) prayed al-ʿAṣr prayer, he would not conversate with anyone up until the sun had set (ie: he was busy with supplication).",
            "part_number": 19,
            "part_page": 24,
            "title": "al-Tamhīd limā fī ʾl-Muwaṭṭaʾ min al-Maʿānī wa ʾl-Asānīd",
            "url": "https://t.me/ilmtest/4190"
        },
        {
            "author": "ʿAbd al-Razzāq al-Ṣanʿānī",
            "body": "From Ibn Jurayj that ʿAṭāʾ said: “If the day of al-Jumuʿah (ie: Friday) and ʿĪd al-Fīṭr fall on the same day, then a person should combine both prayers (ie: the Jumuah and ʿĪd prayer) and offer two rakʿats only, when he offers the prayer of ʿĪd.\nAnd then he will remain like that until the time of Asr begins”.\n(Ibn Jurayj) then said: Then he narrated to me: On an occasion the day of al-Jumuʿah and ʿĪd fell on the same day at the time of Ibn ʿl-Zubayr.\nIbn al-Zubayr said: “Two ʿĪds have fallen on the same day.”\nThen he combined both of them and declared it as one,\nAnd he offered two rakʿats on the day of al-Jumuʿah of ʿĪd and then he did not offer any prayer until the prayer of al-ʿAṣr“.\n(ʿAṭāʾ) said: “As far as al-fuqahāʾ (ie: the jurists) are concerned then they do not tend to agree with this and as far as a person who does not contemplate the fiqh of this matter, then he denies it”.\n(ʿAṭāʾ) said, “I also denied this fatwá and offered al-Dhuhr on that day.”\n(He continued): Until later on, the tradition had reached to me that: “If two ʿĪds fall on the same day then it will be offered only one time (out of two prayers).”\n(Ibn Jurayj) said: And it has also been narrated from Muḥammad b. ʿAlī b. al-Ḥusayn: “If two ʿĪds fall on the same day then they will be combined as one prayer.”",
            "days": [5],
            "hijri_dates": [1],
            "hijri_months": [10],
            "part_number": 3,
            "part_page": 303,
            "title": "al-Muṣannaf",
            "url": "https://t.me/ilmtest/3000"
        },
        {
            "after": {
                "events": ["fajr", "asr"]
            },
            "author": "ʿAbd al-ʿAdhīm al-Munḏirī",
            "body": "Abū Zuhayrah ʿUmārah b. Ruwaybah (may Allah be pleased with him) reported that the Messenger ﷺ said: “One who offers prayer before the rising of the sun, and the setting of the sun will not enter the Fire.” This is referring to al-Fajr and al-ʿAṣr.\nReported by Muslim.",
            "part_number": 1,
            "part_page": 175,
            "title": "al-Tarġīb wa ʾl-Tarhīb",
            "url": "https://t.me/ilmtest/2266"
        },
        {
            "after": {
                "events": ["fajr", "asr"]
            },
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "Preserving the Fajr and ʿAṣr prayers is from the reasons for looking at the Face of Allah. Preserve the Fajr and ʿAṣr prayer, and you will look at the Face of Allah on the Day of Resurrection in the Gardens of Delight.",
            "part_number": 5,
            "part_page": 58,
            "title": "Sharḥ Riyaḍ al-Ṣāliḥīn",
            "url": "https://t.me/ilmtest/1606"
        },
        {
            "after": {
                "events": ["dhuhr"]
            },
            "author": "ʿAbd al-Muḥsin al-ʿAbbād",
            "body": "Explanation of the ḥadīth: “Four before al-Dhuhr (noon prayer); there is no taslīm (concluding salutation) among them; for them the gates of heaven are opened.”\nThe compiler, may Allah have mercy on him, said: [ḥaddathanā Ibn al-Muthanná; ḥaddathanā Muḥammad b. Jaʿfar; ḥaddathanā Shuʿbah; he said: I heard ʿUbaydah narrating from Ibrāhīm, from Ibn Minjāb, from Qurthaʿ, from Abū Ayyūb (may Allah be pleased with him) from the Prophet ﷺ who said: “Four before Dhuhr; there is no taslīm among them; for them the gates of heaven are opened.”\nAbū Dāwūd said: It reached me from Yaḥyá b. Saʿīd al-Qaṭṭān that he said: If I were to narrate anything from ʿUbaydah, I would narrate this ḥadīth from him.\nAbū Dāwūd said: ʿUbaydah is ḍaʿīf (weak).\nAbū Dāwūd said: Ibn Minjāb is Sahm.\nAbū Dāwūd — may Allah have mercy on him — brought the ḥadīth (prophetic report) of Abū Ayyūb (may Allah be pleased with him) that the Prophet ﷺ said: “Four before Dhuhr; there is no taslīm among them; for them the gates of heaven are opened).”\nThis indicates the ṣalāh (prayer) of four before Dhuhr, and that there is no taslīm among them — its meaning is that they are connected, with no taslīm in the middle but rather at the end. However, the aḥādīth have come stating that the ṣalāh is two by two, and the ḥadīth contains this man about whom there is criticism.\nal-Albānī graded this ḥadīth ḥasan (good), and I do not know what the basis of declaring it good is, for the man in the isnād (chain of transmission) is weak and underwent ikhtiṭlāṭ (confusion), and he is ʿUbaydah b. Muʿattib.\nSo if there are shawāhid (supporting narrations) or something relied upon other than this route, then there would be a case for it. And even if the ḥadīth were ṣaḥīḥ (authentic), what is preferable is that the rawātib (regular supererogatory prayers) and the nawāfil (supererogatory prayers) be performed two by two, and it is permissible to perform them as a continuous sequence if the ḥadīth from the Messenger of Allah ﷺ is authentic.\nShaykh Nāṣir — may Allah have mercy on him — authenticated the ḥadīth with the wording: “Four rakʿahs (units of prayer) after zawāl (when the sun passes the meridian) before Dhuhr; there is no taslīm between them; they are equivalent to the ṣalāt al-saḥar (pre-dawn prayer).”\nIt is in al-Silsilah al-Ṣaḥīḥah, volume three.\nIf the ḥadīth is authentic, then it is permissible to string them together, though not stringing them together is preferable.\nJust as the night ṣalāh is “two by two,” it is permissible to combine as four on its own, and four on its own, and three on its own, as that has come from the Messenger of Allah—may Allah bless him and grant him peace—so connecting and separating are both permissible, but separating is preferable to connecting.\nAnd if we say connecting them is allowed, then does one perform a middle tashahhud?\nThe answer that appears is that he does not perform it, so that it does not become as though it were Dhuhr; for if a person were to do that, it would be as though he had prayed Dhuhr.",
            "part_number": 156,
            "part_page": 22,
            "title": "Sharḥ Abī Dāwūd",
            "url": "https://t.me/ilmtest/5608"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "before": {
                "events": ["dhuhr"]
            },
            "body": "ʿUmar b. al-Khaṭṭāb (may Allah be pleased with him) reported that the Messenger (ﷺ) said: “Whoever sleeps without doing his regular ḏikr or part of it, then recites it during the time between the Fajr prayer and Dhuhr prayer, it will be recorded as if he had recited it at night.”\nReported by Muslim, Abū Dāwūd, al-Tirmiḏī, al-Nasāʾī, Ibn Mājah, and Ibn Khuzaymah in his Ṣaḥīḥ.\nṢaḥīḥ",
            "part_number": 1,
            "part_page": 419,
            "title": "Ṣaḥīḥ al-Tarġīb wa ʿl-Tarhīb",
            "url": "https://t.me/ilmtest/4153"
        },
        {
            "after": {
                "events": ["dhuhr"]
            },
            "author": "al-Nasāʾī",
            "body": "Umm Ḥabībah (may Allah be pleased with her) that the Prophet (ﷺ) said: “Whoever prays four (rakʿahs) before al-Dhuhr and four after it, the Fire will not touch him.”",
            "part_number": 2,
            "part_page": 188,
            "title": "al-Sunan al-Kubrá",
            "url": "https://t.me/ilmtest/4116"
        },
        {
            "after": {
                "events": ["fajr"]
            },
            "author": "Rabīʿ b. Hādī al-Madkhalī",
            "body": "Question: “What is the correct position for working according to the calendar times for the prayers and that which is printed and circulated among many of the people especially in the West? Is it simply according to the entrance of the time specified on the calendar or is it better to wait a little to be on the safe side? We would like from you noble Shaykh some instruction for those in charge on the Masjids. And if differing occurs amongst the people concerning this matter what do you advise them with?”\nAnswer: This requires precise experimenting and testing of these calendars by way of study from the Muslims ‘on the ground’ as they say.\nThey look at the time of Fajr on the calendar to see what hour and minute the calendar says, then they go outside of the city to a place that has no lights and they look for the light of Fajr in real time; as it has been described by the Messenger peace be upon him. If they see that it agrees with the calendar, they affirm it. If it differs then say to the Muslims, this differs from the actual time therefore wait this amount of time.\nThis problem is found in the Muslim countries now; in Morocco and other places; in Algeria and other places unfortunately. The Muslims have become careless with regards to their prayer. Some people have complained that they set the time for Fajr about fifteen minutes before it enters. And Allah knows best.\nWe said to the Salafis; ‘experiment’. Go outside of the cities and look at the time of Fajr in a place that is far from lights. Fajr will become clear to you upon its reality. If it agrees (with the calendar) all praises belong to Allah. We will be relieved from the suspicions, problems and delusions, and confusion of the people. If it does not agree (with the calendar) then we present this to the responsible authority at the ministry. We say to them, we have experimented, and we would like to go out with you all for a second experiment. We found this time while the calendar contradicts the real time. This is my view on issue.",
            "part_number": 2,
            "title": "rabee.net",
            "url": "https://t.me/ilmtest/1881"
        },
        {
            "after": {
                "events": ["fajr", "sunrise"]
            },
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "A question for the esteemed Shaykh!\n“I miss the Fajr prayer often,\nand I do not pray (it) except after sunrise at the time I want to go to work.\nAnd this matter might happen again and again, so is there any (sin) upon me?\nAnd What should I do in order to stick to my prayer on time?”\nAnswer: Do a number of things.\nFirstly: That you sleep early.\nAnd it is for this reason the Prophet ﷺ used to hate (one's) sleeping before al-ʿIshāʾ and enganging in discussions after it.\nSo that a person may go to sleep early in order to wake up early.\nSecondly: that you have an intention at the time of going to sleep. a resolve, and determination that you are going to wake up for Ṣalāt al-Fajr.\nThen waking up will be easy for you.\nThirdly: is that you use an alarm clock you put by your head that sets off an alarm for you.\nAnd if you are afraid that when it goes off, you will switch it off, turn off the sound, and keep sleeping, keep it away from you a bit.\nAnd someone, out of concern for the prayer, would put the alarm clock in a tin can,\nAnd keep it at a distance from himself, so that it would have a powerful sound, so he would wake up.\nDo this.\nThere is nothing prohibiting (it).\nIf this were not easy for you, put a telephone by your head, if you have a telephone,\nAnd tell one of your brothers: “When the Aḏān for al-Fajr is given, call me.”\nWhat is important is that a person can do things which result in his waking up so that he can perform al-Fajr in its time.\nAnd one who makes laziness a habit for himself will remain upon laziness.\nAs for prayer in other than its time, if one intended [that], then the prayer is not accepted.\nIt is rejected from him,\neven if he were to pray it a thousand times,\ndue to the saying of the Prophet: “Whoever does an act that is not under our legislation, it will be rejected.”\nmeaning it is returned back to him (ie: not accepted).",
            "part_number": 32,
            "part_page": 23,
            "title": "al-Liqāʾ al-Shahrī",
            "url": "https://t.me/ilmtest_research/277"
        },
        {
            "after": {
                "events": ["lastThirdOfTheNight"]
            },
            "author": "Aḥmad b. Ḥanbal",
            "body": "Abū Hurayrah (may Allah be pleased with him) reported that Allah's Messenger ﷺ said, “Our Lord, the Mighty and Majestic, comes every night down on the nearest Heaven to us when the last third of the night remains, saying: ”Is there anyone to invoke Me, so that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is there anyone seeking My forgiveness, so that I may forgive him?\"",
            "part_number": 16,
            "part_page": 211,
            "title": "al-Musnad",
            "url": "https://t.me/ilmtest/2111"
        },
        {
            "after": {
                "events": ["lastThirdOfTheNight"]
            },
            "author": "Ibn Rajab",
            "body": "And some people who were known for this (to rely on the stars for knowledge of what may or may not happen) objected to the ḥadīth where the Prophet ﷺ said that Allah descends in the third of the night, so they said: “The third of the night differs depending on the country, and it is not possible that Allahs descension be at any specific time.” However, that which is obligatory to have knowledge of in Islām, is that this type of objection is completely disgusting.\nAnd that if the Prophet Muḥammad ﷺ and His rightly guided Caliphates were to hear this from this person, they would not even look at him,\nRather they would take him to his punishment, and include him in al-mukhālifīn (ie: the group of those who go against the truth), al-munāfiqīn (ie: the hypocrites), and al-mukhaḏibīn (ie: the liars).",
            "part_number": 1,
            "part_page": 2,
            "title": "Bayān Faḍl ʿIlm al-Salaf ʿalá ʿIlm al-Khalaf",
            "url": "https://t.me/ilmtest/2110"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "before": {
                "diff": "1h",
                "events": ["middleOfTheNight"]
            },
            "body": "When Does The Time of Ṣalāt al-ʿIshāʾ End?\nQuestioner: “Up until what time is it permissible to delay Ṣalāt al-ʿIshāʾ?”\nThe Shaykh: Up until half of the night (has passed),\nSince that has been clearly stated in Ṣaḥīḥ Muslim,\nFrom the ḥadīth of ʿAbd Allah b. ʿAmr b. al-ʿĀṣ (may Allah be pleased with him), who said: the Messenger of Allah ﷺ said: “And the time for al-ʿIshāʾ is until half the night has passed.”\nAnd (its time) is not until al-Fajr al-Ṣādiq (ie: the time of the true dawn prayer) appears,\nFor there is no dalīl (ie: proof) for that even if some of the Imāms say so,\nBecause that goes against this authentic ḥadīth, \"And the time for al-ʿishāʾ is until half the night has passed.\nYes.",
            "part_number": 97,
            "part_page": 16,
            "title": "Silsilah al-Hudá wa ʾl-Nūr",
            "url": "https://t.me/ilmtest/3310"
        },
        {
            "author": "Ibn Taymiyyah",
            "body": "And in the wording of Abū Hurayrah (may Allah be pleased with him) that the Messenger ﷺ said: The first deed for which a servant will be called to account on the Day of Resurrection is his ṣalāt (ie: prayer).\nIf it is complete, he will be successful and saved,\nbut if it is deficient or corrupted, he will have failed and lost.\nSo if there something is deficient in his obligatory prayers,\nthe Lord (the Mighty and Majestic) will say: “Look, are there any voluntary Prayers for my worshipper?”\nSo with the voluntary prayers what was deficient in his obligatory prayers will be completed.\nThen the rest of his deeds will be treated in the same manner.\nReported by al-Tirmiḏī who said the ḥadīth is Ḥasan.",
            "id": 110885,
            "part_number": 22,
            "part_page": 533,
            "title": "Majmūʿ al-Fatāwá",
            "url": "https://t.me/ilmtest/3967"
        },
        {
            "author": "al-Bayhaqī",
            "body": "Narrated Abū Hurayrah (may Allah be pleased with him): When Allah's Messenger ﷺ made the (opening) takbīr for the prayer, he used to keep silent before his recitation (of the Qurʾān).\nSo we said (to the Prophet ﷺ): “May my parents be sacrificed for you!\nWe saw that you remain silent between al-takbīr wa ʿl-qirāʿah, what do you say (in the pause between takbīr and recitation)?”\n(The Prophet ﷺ) said: I say: “Allahumma bāʿid baynī wa bayna khaṭāyāya kamā bāʿadta bayn al-mashriqi wa ʿl-maġribi (ie: O Allah, separate me from my sins as You have separated the East from the West),\nAllahumma naqqinī min khaṭāyāya kamā yunaqqath-thawb ʿl-abyaḍu min ʿl-danasī (ie: O Allah, cleanse me of my transgressions as the white garment is cleansed of stains),\nAllaahuma aġsilnī min khaṭāyāya, bith-thalji wa ʿl-māʿi wa ʿl-barad (ie: O Allah, wash away my sins with ice and water and frost).”\nReported by Muslim in his Ṣaḥīḥ from Zuhayr b. Ḥarb from Jarīr, and also by way of ʿAbd al-Wāḥid b. Ziyād b. ʿUmārah.",
            "id": 111116,
            "part_number": 4,
            "part_page": 492,
            "title": "Shuʿab al-ʾĪmān",
            "url": "https://t.me/ilmtest/3975"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "The Messenger ﷺ used to order to being tranquil (in the rukūʿ);\nand he said to the person who did not pray properly:\n“Then raise your head until you are standing straight; [until every bone goes back to its place]”,\n(and in a narration: “And when rise from rukūʿ; then straighten your back,\nand raise your head until the bones go back to their joints.”)\nAnd he mentioned to him: “That no one's prayer is complete, if he does not do that.”",
            "id": 111204,
            "part_number": 2,
            "part_page": 700,
            "title": "Aṣl Ṣifah Ṣalāh al-Nabī ṢallAllāhu ʿAlayhi Wa Sallam",
            "url": "https://t.me/ilmtest/3998"
        },
        {
            "author": "al-Bukhārī",
            "body": "al-Bukhārī said: Whoever claims that raising the hands (in prayer) is a bidaʿh (ie: an innovation),\nthen he has defamed the Companions of the Prophet ﷺ,\nand the Salaf and those who came after them,\nand the people of al-Ḥijāz,\nthe people of al-Madīnah,\nthe people of Makkah,\nand a number from the people of al-ʿIrāq\nand the people of al-Shām,\nthe people of Yemen\nand the scholars of Khurasān.",
            "id": 117243,
            "part_number": 1,
            "part_page": 54,
            "title": "Rafʿ al-Yadayn fī ʿl-Ṣalāt",
            "url": "https://t.me/ilmtest/4407"
        },
        {
            "author": "al-Ḏahabī",
            "body": "Ibn al-Madīnī said to Abū ʿl-Walīd: “What excuse will you have before Allah, and by what will you argue when you stand before Him, for leaving the practice of raising the hands before and after bowing in prayer?”\nSo Abū ʿl-Walīd raised his hands after eighty years of not doing so.",
            "id": 119908,
            "part_number": 5,
            "part_page": 718,
            "title": "Tārīkh al-Islām",
            "url": "https://t.me/ilmtest/4754"
        },
        {
            "author": "Maʿmar b. Rāshid",
            "body": "ʿAbd al-Razzāq informed us, on the authority of Maʿmar, on the authority of Qatādah that Kaʿb (may Allah be pleased with him) said: “The first thing a woman will be asked about on the Day of Resurrection will be her ṣalāt (ie: prayer) and the ḥaqqi zawjihā (ie: rights of her husband).”",
            "id": 124938,
            "part_number": 11,
            "part_page": 304,
            "title": "Jāmīʿ",
            "url": "https://t.me/ilmtest/4945"
        },
        {
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "The noble Shaykh was asked: “What is the ruling on placing the right hand on the left hand and placing it on the chest during prayer?\nWhat is the ruling on placing both hands below the navel?\nAnd is there any difference between men and women in this regard?”\nHe answered: Placing the right hand on the left hand in the prayer is Sunnah.\nThe evidence for this is the ḥadīth of Sahl b. Saʿd (may Allah be pleased with him): “The people were ordered to place their right hand on their left forearm in prayer.” Reported by al-Bukhārī.\nBut where the hands should be placed?\nThe answer: in this regard, the most correct opinion is that the hands should be placed on the chest.\nDue to the ḥadīth of Wāʿil b. Ḥajar (may Allah be pleased with him): “The Prophet used to place his right hand on his left hand on his chest.”\nAlthough the chain of narration of the ḥadīth is slightly weak, it is the most correct compared to other opinions.\nPlacing the hands on the heart on the left side is a bidaʿh (ie: innovation) that has no ʿaṣl (ie: basis).\nAs for placing the hands below the navel, there is an athar from ʿAlī to support this, but it is ḍaʿīf (ie: weak).\nThe ḥadīth of Wāʿil b. Ḥajar (of placing them on the chest) is stronger.\nThere is no difference between men and women in this ruling,\nbecause the general principle is that men and women are equal in al-aḥkām (ie: rulings) unless there is dalīl (ie: evidence) to suggest otherwise.\nAnd I do not know of any sound evidence that distinguishes between men and women in this Sunnah.",
            "id": 120890,
            "part_number": 13,
            "part_page": 97,
            "title": "Majmūʿ al-Fatāwá wa Rasāʿil",
            "url": "https://t.me/ilmtest/4926"
        },
        {
            "author": "Muḥammad b. Ṣāliḥ al-ʿUthaymīn",
            "body": "Q: “Where should a person praying place his two hands in prayer?\nOn his chest?\nOr below his chest?\nOr on his stomach?”\nHe may Allah have mercy on him answered:\nThe correct position is to place his two hands on the chest.\nThis is the best (and most correct opinion), and the evidence for this is the ḥadīth of Wāʿil b. Ḥajar, and this ḥadīth is Ḥasan.",
            "id": 120891,
            "part_number": 8,
            "part_page": 2,
            "title": "Fatāwá Nūrun ʿalá ʾl-Darb",
            "url": "https://t.me/ilmtest/4789"
        },
        {
            "author": "Muḥammad b. Ādam al-Ithīobī",
            "body": "The author (ie: Muḥammad al-Ihtīobī) may Allah forgive him said: In light of al-adillah (Ie: the evidence), al-rājiḥ (ie: the most correct opinion) is that both hands should be placed on the chest during prayer.\nThose who argue for tying the hands below the navel do not have any dalīl ṣaḥīḥ (to support them),\nand those who argue for tying the hands above the navel do not have any evidence either, except that they may interpret placing the hands above the navel as meaning the chest.\nAnd Allah the Exalted knows best what is correct.",
            "id": 120892,
            "part_number": 11,
            "part_page": 281,
            "title": "Ḏakhīrah al-ʿUqbá fī Sharḥ al-Mujtabá",
            "url": "https://t.me/ilmtest/4792"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "(The Messenger ﷺ said): “Remember death in your prayer, for when a man remembers death in his prayer, it is likely that he will improve his prayer.\nPray the prayer of a man who does not think that he will pray any prayer other than it.\nAnd beware of every matter from which one must apologize.”\nReported by al-Daylamī in Musnad al-Firdaws on the authority of Anas who raised it (to the Prophet ﷺ).",
            "id": 121084,
            "part_number": 3,
            "part_page": 408,
            "title": "Silsilah al-Aḥādīth al-Ṣaḥīḥah",
            "url": "https://t.me/ilmtest/4801"
        },
        {
            "author": "Ibn al-Qayyim",
            "body": "You stand in your prayer with your body whilst you have turned your face towards al-qiblah (ie: direction of the Kaʿbah), but you have turned your qalb (ie: heart) towards another place?\nWhat's the matter with you - this prayer is not suitable as mahr (ie: dowry) for al-Jannah (ie: Paradise),\nso how could it be suitable as a price for al-maḥabbah (ie: love of Allah).",
            "id": 122102,
            "part_number": 3,
            "part_page": 233,
            "title": "Badāʾi al-Fawāʾid",
            "url": "https://t.me/ilmtest/4976"
        },
        {
            "author": "Muḥammad Nāṣir ʾl-Dīn al-Albānī",
            "body": "[Ḥasan] On the authority of Abū Hurayrah (may Allah be pleased with him) that the Prophet ﷺ he said:\n“A man may pray for sixty years, and his prayer will not be accepted.\nPerhaps he may complete al-rukūʿ (ie: the bowing) but not complete al-sujūd (ie: the prostration properly),\nor he may complete al-sujūd but not complete al-rukūʿ (properly).”",
            "id": 124887,
            "part_number": 1,
            "part_page": 347,
            "title": "Ṣaḥīḥ al-Tarġīb wa ʿl-Tarhīb",
            "url": "https://t.me/ilmtest/5121"
        }
    ]
}
